{"about_the_game":"<strong><i>&quot;Vault: Tomb of the King is Zelda but Trine, or Trine but Zelda: it's basically a big dungeon filled with puzzle spaces.&quot;</i><br>-PC Gamer Magazine</strong><br><br>For years, adventurers have entered King Allard's tomb in search of the fabled treasure locked inside. None have been successful, until now.<br><br><ul class=\"bb_ul\"><li>Dynamically switch between three heroes to overcome deadly traps, enemies and puzzles.<br><br></li><li>Purchase new items and upgrade your abilities to improve your chance of survival.<br><br></li><li>Enjoy challenging hand crafted levels and puzzles that will test your wits and dexterity.<br><br></li><li>Experience an engaging story and uncover the truth about King Allard's Tomb.</li></ul>","background":"https://store.akamai.steamstatic.com/images/storepagebackground/app/1252500?t=1585315773","background_raw":"https://store.akamai.steamstatic.com/images/storepagebackground/app/1252500?t=1585315773","capsule_image":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/capsule_231x87.jpg?t=1585315773","capsule_imagev5":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/capsule_184x69.jpg?t=1585315773","categories":[{"description":"Single-player","id":2},{"description":"Game demo","id":10},{"description":"Full controller support","id":28}],"content_descriptors":{"ids":[],"notes":null},"controller_support":"full","detailed_description":"<strong><i>&quot;Vault: Tomb of the King is Zelda but Trine, or Trine but Zelda: it's basically a big dungeon filled with puzzle spaces.&quot;</i><br>-PC Gamer Magazine</strong><br><br>For years, adventurers have entered King Allard's tomb in search of the fabled treasure locked inside. None have been successful, until now.<br><br><ul class=\"bb_ul\"><li>Dynamically switch between three heroes to overcome deadly traps, enemies and puzzles.<br><br></li><li>Purchase new items and upgrade your abilities to improve your chance of survival.<br><br></li><li>Enjoy challenging hand crafted levels and puzzles that will test your wits and dexterity.<br><br></li><li>Experience an engaging story and uncover the truth about King Allard's Tomb.</li></ul>","developers":["Erich Preston"],"fullgame":{"appid":"1251800","name":"Vault: Tomb of the King"},"genres":[{"description":"Action","id":"1"},{"description":"Adventure","id":"25"},{"description":"Indie","id":"23"},{"description":"RPG","id":"3"}],"header_image":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/header.jpg?t=1585315773","is_free":true,"legal_notice":"VAULT: TOMB OF THE KING - END USER LICENCE AGREEMENT<br><br>PLEASE READ THIS END USER LICENCE AGREEMENT CAREFULLY.<br><br>Vault: Tomb of the King is a pay-to-play computer game developed, owned and operated by 2651990 Ontario Ltd. In this agreement the “Owner” means 2651990 Ontario Ltd., an Ontario, Canada Corporation. This End User Licence Agreement (“EULA”) governs Your (“User” or “You”) use of the Vault: Tomb of the King videogame, application, software, their associated upgrades, patches, and updates and related services (the “Product”) currently provided or which will be provided by the Owner.<br><br>THIS EULA SETS OUT THE BASIS ON WHICH THE OWNER MAKES THE PRODUCT AVAILABLE TO YOU AND ON WHICH YOU MAY USE THE PRODUCT.<br><br>The Owner (or its licensors) are willing to provide You with a limited use license to the Product (as detailed below) on the condition that you accept and agree to all of the terms and conditions of this EULA and your continued compliance with this EULA.<br><br>You must indicate Your acceptance of and agreement with the terms of this EULA by clicking on the “I Agree” button. PLEASE READ THE TERMS AND CONDITIONS OF THIS EULA CAREFULLY BEFORE SELECTING “I Agree”.<br><br>By selecting “ACCEPT” to accept this EULA, and/or by loading, installing, or running the Product, or placing or copying the Product onto Your computer hard drive, or other storage, You acknowledge and agree: (1) that you have read this EULA, understand it and agree to be bound<br>by all of its terms and conditions; and, (2) this EULA is enforceable like any written contract signed by You.<br><br>If you Do Not Agree to all of the terms and conditions of this EULA, click on the “CANCEL”<br>button which indicates that you Do Not Agree to accept the terms and conditions of this EULA<br>and will not complete installation of the Product.<br><br>The Owner’s Privacy Policy (the “Privacy Policy”) forms an integral part of this EULA and can be<br>found at . You agree to<br>accept and to be bound by this EULA and the Privacy Policy at any and all times. If You do not<br>agree with one of these do not install or use the Product.<br><br>This EULA shall coexist with, and shall not supersede, any Terms of Use of the Owner’s<br>websites, including but not limited to . To the extent that the<br>provisions of this EULA conflict with the provisions of any such Terms of Use, the conflicting<br>provisions in the Terms of Use shall govern.<br><br>To accept the terms of this EULA and create a Vault: Tomb of the King Account (if any)<br>(“Account”), YOU MUST BE AN ADULT OF THE LEGAL AGE OF MAJORITY IN THE JURISDICTION<br>WHERE YOU RESIDE. You are legally and financially responsible for any and all actions in<br>exercising Your license of the Product and/or on your Account (if any), including the actions of<br>children and anyone else who you permit (directly or indirectly) to access the Product and/or<br>your Account (if any).<br><br>By entering into this EULA you affirm that you have reached the legal age of majority, and have<br>the legal capacity to enter into a contract, in the jurisdiction where you reside, EVEN IF YOU<br>ARE ENTERING INTO THIS EULA ON BEHALF OF A USER WHO IS UNDER THE LEGAL AGE OF<br>MAJORITY AS THEIR PARENT AND/OR LEGAL GUARDIAN.<br><br>The Owner reserves the right to change, modify, add or delete articles in this EULA at any time,<br>in accordance with the procedures described below in Section 8.<br><br>1. LIMITED USE LICENSE.<br>1.1 The Owner (or its licensors) grants You a non-exclusive, non-transferable, non-sublicense,<br>non-commercial, revocable and personal limited license to install and/or use the Product, in<br>whole or in part, for your own non-commercial entertainment purposes only (the “License”),<br>for such time until either You or the Owner terminates this EULA in accordance with the terms<br>herein. THIS PRODUCT IS LICENSED TO YOU, NOT SOLD.<br><br>As applicable, certain parts of the Product may use third party features, some of which are<br>managed by third-party providers for which additional terms and/or costs may apply. You must<br>comply with such additional terms: for instance, if the Product is featuring a VoIP application,<br>then You must comply with the associated wireless data service agreement when using the<br>Product). Please review such additional third-party terms and costs carefully.<br><br>1.2 The limited, personal use license granted to You in Section 1.1 is subject to the following<br>restrictions and limitations, as well as all other terms and conditions of this EULA, and You<br>acknowledge and agree that:<br><br>i. You shall not, directly or indirectly, under any circumstances:<br><br>a. sell, rent out, lease, (sub)license, assign, distribute, market, exploit the Product or<br>any of its parts commercially, except as may be expressly permitted by the Owner;<br><br>b. reverse engineer, decompile, disassemble, adapt, reproduce, or create derivate<br>works of this Product, in whole or in part;<br><br>c. create, use and/or distribute “auto”, “trainer”, “script” or “macro” computer<br>programs or other “cheat” or “hack” programs or software applications for the<br>Product (whether in an online multiplayer game or in a single player game over the<br>internet or in local area network);<br><br>d. remove, alter, disable or circumvent any copyright and trademark indications or<br>other authorship and origin information, notices or labels contained on or within the<br>Product;<br><br>e. export or re-export the Product or any copy or adaptation in violation of any<br>applicable laws or regulations;<br><br>f. create any other software or content that incorporates the Product or any portion<br>thereof;<br><br>g. disclose any unused, pending, or undetermined features you may find in the<br>Software, which are confidential trade secrets of the Owner.<br><br>ii. You agree to comply with all applicable laws, rules and regulations.<br><br>iii. You agree to comply with certain rules of conduct that govern Your use of the Product<br>(“Rules of Conduct”), which are not meant to be exhaustive and can be modified at any<br>time by the Owner. In all cases, You may only use the Product according to the<br>anticipated use of the Product.<br><br>The Rules of Conduct shall include, but are not limited to, the following restrictions, and<br>without in any way limiting the Owner’s rights to take action against You, You<br>acknowledge and agree that You will not:<br><br>a. create, use, share and/or publish by any means in relation to the Product any<br>material (text, words, images, sounds, videos, etc.) which would breach a duty of<br>confidentiality, infringe any intellectual property right or an individual’s right to<br>privacy or which would incite the committing of an unlawful act (in particular, piracy,<br>cracking or circulation of counterfeit software);<br><br>b. modify, distort, block, abnormally burden, disrupt, slow down and/or hinder the<br>normal functioning of all or part of the Product, or their accessibility to other Users,<br>or the functioning of the partner networks of the Product, or attempt to do any of<br>the above;<br><br>c. transmit or propagate any virus, trojan horse, worm, bomb, corrupted file and/or<br>similar destructive device or corrupted data in relation to the Product, and/or<br>organize, participate in or be involved in any way in an attack on the Owner’s servers<br>and/or the Product and/or those of its service providers and partners;<br>\t<br>d. create, supply or use alternative methods of using the Product, for example server<br>emulators;<br><br>e. transmit or communicate any material or content which, in the sole and exclusive<br>discretion of the Owner, is believed or deemed offensive, including, but not limited<br>to, language that is harmful, threatening, unlawful, abusive, harassing, defamatory,<br>disparaging, obscene, sexually explicit, or racially, ethnically, or otherwise<br>objectionable;<br><br>f. harass or threaten any other User(s) of the Product;<br><br>g. make inappropriate use of the help service or send untruthful reports to members of<br>the Owner’s personnel;<br><br>h. falsely claim to be an employee or representative of the Owner or its partners<br>and/or agents;<br><br>i. falsely claim an endorsement in connection with the Product or with the Owner.<br><br>2. OWNERSHIP.<br><br>All title, ownership rights and intellectual property rights in and to the Product (including,<br>without limitation, all text, graphics, music or sounds, all messages or items of information,<br>fictional characters, names, themes, objects, scenery, costumes, effects, dialogues, slogans,<br>places, characters, diagrams, concepts, choreographies, videos, audio-visual effects, domain<br>names and any other elements which are part of the Product, individually or in combination)<br>and any and all copies thereof are owned by the Owner or its licensors. The Product is<br>protected by national and international laws, copyright treaties and conventions and other<br>laws. The Product may contain certain licensed materials and, in that event, the Owner’s<br>licensors may protect their rights in the event of any violation of this EULA. Any reproduction or<br>representation of these licensed materials in any way and for any reason is prohibited without<br>the Owner’s prior permission and, if applicable, the Owner’s licensors’ and/or representatives’.<br>Except as expressly set forth in this EULA, all rights not granted hereunder to You are expressly<br>reserved by the Owner.<br><br>The License confers no title or ownership in the Product and should not be construed as a sale<br>of any rights in the Product.<br><br>3. ACCESS TO THE PRODUCT.<br><br>3.1 THE PRODUCT MAY BE PROTECTED BY DIGITAL RIGHTS MANAGEMENT SOFTWARE (“DRM<br>SOFTWARE”), IN PARTICULAR DEPENDING ON THE SYSTEM OR DEVICE YOU USE TO ACCESS THE<br>PRODUCT. IN SUCH CASE, YOU HEREBY AGREE, ACKNOWLEDGE AND CONSENT TO THE<br>FOLLOWING REGARDING DRM SOFTWARE: (I) THE INSTALLATION OF THE PRODUCT MAY CAUSE<br>DRM SOFTWARE TO BE INSTALLED ON YOUR COMPUTER; (II) DRM SOFTWARE MAY LIMIT THE<br>NUMBER OF INSTALLATIONS OF THE PRODUCT; (III) DRM SOFTWARE MAY INSTALL ON YOUR<br>COMPUTER ADDITIONAL COMPONENTS REQUIRED FOR COPY PROTECTION; AND (IV) DURING<br>THE INSTALLATION AND/OR THE FIRST LAUNCH OF THE PRODUCT, AN ONLINE CONNECTION<br>MAY BE REQUIRED TO UNLOCK THE PRODUCT THROUGH DRM SOFTWARE. IN NO EVENT SHALL<br>THE OWNER BE LIABLE IN CONNECTION WITH THE COMPONENTS THAT MAY BE INSTALLED ON<br>YOUR COMPUTER BY ANY DRM SOFTWARE. FOR FURTHER INFORMATION, PLEASE VISIT THE<br>WEBSITE OF THE DRM SOFTWARE APPEARING DURING THE INSTALLATION OF THE PRODUCT.<br>RESTRICTIONS OF AGE MAY BE IMPOSED TO ACCESS ONLINE SERVICES AND FEATURES IN<br>COMPLIANCE WITH LOCAL LAWS.<br><br>3.2 If You are using the Product on a Compatible Mobile Terminal, this Section 3.2 is applicable<br>to You and to Your use of the Product.<br><br>In this EULA, “Compatible Mobile Terminal” means any portable device capable of connecting<br>to the Internet to access the Product. The term Compatible Mobile Terminal covers in particular<br>feature phones, smartphones, tablet computers, and personal digital assistants (PDAs).<br><br>i. Product Access. To use the Product on a Compatible Mobile Terminal, You must have<br>access to an electronic communication network. The connection costs (including but not<br>limited to mobile providers’ and/or carriers’ costs), shall be exclusively borne by You.<br>You acknowledge and agree that the quality of the Product, the response time or access<br>to certain features may depend on the capacities of Your Compatible Mobile Terminal<br>and of the electronic communication network. The Owner may in no case be held<br>responsible for reduced user comfort. You acknowledge and agree that the Product may<br>not be available for use on all mobile devices or through all carriers or network service<br>providers.<br><br>ii. Collection of personal data. In order to provide You with a better game experience,<br>adapted services and Product support, the Owner may collect and store data about You<br>in relation to Your use of the Product, Your connection information and/or Your<br>Compatible Mobile Terminal. Your privacy is very important to the Owner and the<br>Owner will not reveal Your personal data to third parties except when expressly<br>authorized by You to do so or in special circumstances. The Owner may be under a duty<br>to disclose or share Your personal data in order to comply with a legal obligation, or in<br>order to protect the Owner’s rights and those of other users and third parties, such as<br>exchanging information with other companies and organizations for the purposes of<br>fraud protection and credit risk reduction. In addition, the Owner reserves the right to<br>collect, store and use anonymous data about You. For further information concerning<br>the Owner’s use of Your personal data, please refer to the Privacy Policy.<br><br>iii. Analytics Tools and Ad Serving Technology. The Owner uses third party analytics tools to<br>collect information concerning Your and other users’ gaming habits and use of the<br>Product. The information collected may contain the following, without limitation:<br>mobile device unique identity or other device identifiers and settings, carrier, operating<br>system, localization information, date and time spent on the Product, game scores,<br>game metrics and statistics, feature usage, advertising conversion rates, monetization<br>rate, purchase history and other similar information. The Owner uses third party ad<br>serving technologies that may collect information as a result of ad serving in the Product<br>and that may temporarily display advertisements in the Product. The information<br>collected and used for the targeted advertising may include, but is not limited to, the<br>following: age and/or gender, number views of an advertisement, mobile device unique<br>identity or other device identifiers and settings, information about Your use of the<br>Product, Compatible Mobile Terminal, and other Internet sites (including third party<br>web pages and mobile Internet sites) viewed by You (as well as date and time viewed),<br>advertisement(s) served, the advertisement(s)’ in game location and length, and Your<br>response to the advertisement(s) (if any). The analytics tools and ad serving<br>technologies may use server log files, web beacons, cookies, tracking pixels and other<br>technologies to collect said information and may combine the information collected on<br>other products and services of the Owner with information collected from other third-<br>party websites and mobile products and services and with demographic, advertisement,<br>market and other analytics surveys. Standing alone, this information is not personal<br>data; however, if the Owner combines any of this information with personal data, the<br>Owner will treat this information as personal data pursuant to our Privacy Policy. You<br>will find a non-exhaustive list of our partners whose analytic tools and ad serving<br>technologies are used in our Product(s) at [WEB ADDRESS].<br><br>4. WARRANTY DISCLAIMER, LIMITATION OF LIABILITY.<br><br>YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT USE OF THE PRODUCT IS AT YOUR OWN<br>RISK. TO THE FULLEST EXTENT PERMISSIBLE UNDER APPLICABLE LAW, THE PRODUCT IS<br>SUPPLIED ON AN “AS IS” AND “AS AVAILABLE” BASIS. THE OWNER, THE OWNER’S LICENSORS,<br>CHANNEL PARTNERS AND ASSOCIATED SERVICE PROVIDERS DO NOT MAKE, AND HEREBY<br>DISCLAIM, ANY GUARANTEES, CONDITIONS AND/OR WARRANTIES OF ANY KIND, EXPRESS,<br>IMPLIED OR STATUTORY, OR OTHER TERMS INCLUDING AS TO: (A) ITS CONFORMITY,<br>ACCURACY, CURRENTNESS, COMPLETENESS, RELIABILITY OR SECURITY; (B) ITS SUITABILITY FOR<br>A PARTICULAR USE; (C) IMPLIED WARRANTIES OF TITLE, NON-INFRINGEMENT; (D) ITS MARKET<br>VALUE; OR (E) YOUR SATISFACTION. THE OWNER DOES NOT WARRANT THAT THE PRODUCT<br>WILL BE UNINTERRUPTED OR ERROR-FREE, THAT DEFECTS WILL BE CORRECTED, OR THAT THE<br>PRODUCT IS FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS. YOU ASSUME ALL<br>RESPONSIBILITY FOR SELECTING THE PRODUCT TO ACHIEVE YOUR INTENDED RESULTS, AND<br>FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED FROM THE PRODUCT.<br><br>TO THE FULLEST EXTENT PERMISSIBLE UNDER APPLICABLE LAW, IN NO EVENT WILL THE<br>OWNER, THE OWNER’S LICENSORS, CHANNEL PARTNERS AND ASSOCIATED SERVICE PROVIDERS<br>BE LIABLE FOR LOSS OR DAMAGE SUFFERED IN CONNECTION WITH THE USE OF THE PRODUCT<br>OR ANY RELATED THIRD-PARTY SERVICE. THIS INCLUDES WITHOUT LIMITATION (A) ALL LOSSES<br>OF ANY KIND, WHETHER IN TORT (INCLUDING FOR NEGLIGENCE OR BREACH OF STATUTORY<br>DUTY), CONTRACT, MISREPRESENTATION (WHETHER INNOCENT OR NEGLIGENT) OR<br>OTHERWISE; (B) DIRECT LOSS; (C) ACCIDENTAL LOSS; (D) INCIDENTAL LOSS; (E)<br>CONSEQUENTIAL LOSS; AND, (F) INDIRECT LOSS.<br><br>NOTWITHSTANDING THE AFOREMENTIONED LIMITATIONS OF LIABILITY, YOUR SOLE REMEDY<br>IN THE EVENT OF A DISPUTE WITH THE OWNER OR ITS LICENSORS, CHANNEL PARTNERS AND<br>ASSOCIATED SERVICE PROVIDERS IS TO CEASE TO USE THE PRODUCT AND THE OWNER’S<br>LIABILITY IS LIMITED TO THE REFUND (DIRECTLY OR INDIRECTLY THROUGH ITS CHANNEL<br>PARTNERS OR ASSOCIATED SERVICE PROVIDERS) OF THE PURCHASE PRICE OF THE PRODUCT. IN<br>NO EVENT SHALL THE OWNER, ITS AFFILIATES, LICENSORS, CHANNEL PARTNERS AND<br>ASSOCIATED SERVICE PROVIDERS BE LIABLE FOR DAMAGES IN EXCESS OF ANY AMOUNT YOU<br>HAVE PAID TO THE OWNER FOR THE INITIAL PURCHASE OF THE PRODUCT.<br><br>FOR PURPOSES OF THIS SECTION 4, THE OWNER’S LICENSORS, CHANNEL PARTNERS AND<br>ASSOCIATED SERVICE PROVIDERS ARE THIRD PARTY BENEFICIARIES TO THE LIMITATIONS OF<br>LIABILITY SPECIFIED HEREIN AND THEY MAY ENFORCE THIS EULA AGAINST YOU.<br><br>5. INDEMNITY.<br><br>You are solely responsible for any damage caused to the Owner, its licensors, channel partners<br>and associated service providers and subcontractors, other Users of the Product or any other<br>individual or legal entity as a result of Your violation of this EULA.<br><br>YOU HEREBY AGREE TO DEFEND, INDEMNIFY, KEEP INDEMNIFIED AND HOLD HARMLESS THE<br>OWNER AND ITS AFFILIATES, THEIR LICENSORS, CHANNEL PARTNERS AND ASSOCIATED SERVICE<br>PROVIDERS AND THEIR SUBCONTRACTORS AGAINST ANY AND ALL CLAIMS OR ALLEGED<br>CLAIMS, LIABILITIES, LOSSES, DAMAGES AND ALL COSTS (INCLUDING LAWYERS’ FEES), DIRECTLY<br>OR INDIRECTLY ATTRIBUTABLE TO YOUR FAULT AND/OR RESULTING FROM (A) A VIOLATION OF<br>ANY PROVISION OF THIS EULA OR (B) YOUR USE OR MISUSE OF THE PRODUCT. The Owner<br>reserves the right to take sole responsibility, at its own expense, for conducting the defense of<br>any claim for which You agreed to indemnify the Owner.<br><br>6. TERMINATION.<br><br>This EULA is effective from the earlier of the date You purchase, download, or use the Product,<br>until terminated according to its terms, and subject to the survivability of any provisions. You<br>and the Owner (or its licensors) may terminate this EULA, at any time, as follows: (1) You may<br>terminate this EULA by permanently deleting all copies of the Product in your possession or<br>control and removing/uninstalling the Product from your hard drive; (2) The Owner may<br>terminate this EULA at any time for any reason or no reason, effective upon (a) termination of<br>Your Vault: Tomb of the King Account (if any) or (b) at the time of the Owner’s decision to<br>discontinue offering and/or supporting the Product. This EULA will terminate automatically if<br>You fail to comply with any of the terms and conditions of this EULA. Upon termination for any<br>reason, You must immediately uninstall the Product and destroy all copies of the Product in<br>Your possession.<br><br>7. CHANGES TO THIS EULA OR TO THE PRODUCT.<br><br>The Owner reserves the right, in its sole and absolute discretion, to revise, update, change,<br>modify, add to, supplement, or delete certain terms of this EULA for any reason. Such changes<br>will be effective with or, as applicable, without prior notice to You. You can review the most<br>current version of this EULA by clicking on the “EULA” link located on the Product or on [WEB<br>ADDRESS]. You are responsible for checking this EULA periodically for changes. If any future<br>changes to this EULA are unacceptable to You or cause You to no longer be in agreement or<br>compliance with this EULA, You may terminate this EULA in accordance with Section 8 and must<br>immediately uninstall the Product and destroy all copies of the Product. Your continued use of<br>the Product following any revision to this EULA constitutes Your complete and irrevocable<br>acceptance of any and all such changes.<br><br>The Owner may modify the Product for any reason or without any specific reason, at any time<br>and at its entire discretion, in particular (but not limited to) for technical reasons such as<br>updates, maintenance operations and/or resets to improve and/or optimize the Product. You<br>agree that the Product may install or download the modifications automatically. You agree that<br>the Owner may stop to support previous versions of the Product upon availability of an<br>updated version. The Owner’s channel partners and associated service providers shall have no<br>obligation to furnish any maintenance or customer support with respect to the Product. The<br>Owner also reserves the right to amend the Rules of Conduct set out in Section 1 to place limits<br>on the use of the Product.<br><br>You hereby acknowledge and agree that the Owner would suffer irreparable harm if this EULA,<br>the Privacy Policy or Terms of Use (collectively the “Agreements”) were not specifically<br>enforced. Consequently, in addition to such monetary and other relief as may be recoverable at<br>law, you agree that the Owner shall be entitled to appropriate equitable remedies, including<br>but not limited to specific performance or other injunctive relief, without bond, other security,<br>or proof of damages, as remedy for an breach or threatened breach of any of the Agreements.<br><br>8. MISCELLANEOUS.<br><br>8.1 Export Controls. The Product is subject to all applicable export restrictions. You must<br>comply with all export and import laws and restrictions and regulations of any foreign agency or<br>authority relating to the Product and Your use of the Product.<br><br>8.2 Severance. If any court of competent jurisdiction or competent authority finds that any<br>provision of this EULA is invalid, illegal or unenforceable, that provision or part-provision shall,<br>to the extent required, be deemed to be deleted, and the validity and enforceability of the<br>other provisions of this EULA shall not be affected. If any invalid, unenforceable or illegal<br>provision of this EULA would be valid, enforceable and legal if some part of it were deleted, the<br>provision shall apply with the minimum modification necessary to make it legal, valid and<br>enforceable to reflect the Owner’s initial intentions.<br><br>8.3 No Waiver. No failure or delay by the Owner (or its licensors) to exercise any right or<br>remedy provided under this EULA or by law shall constitute a waiver of that or any other right<br>or remedy, nor shall it preclude or restrict the further exercise of that or any other right or<br>remedy. No single or partial exercise of such right or remedy shall preclude or restrict the<br>further exercise of that or any other right or remedy. Waiver of a right or remedy may be<br>considered to have taken place only after signing of a written statement to this effect by the<br>Owner and by the User.<br><br>8.4 Law and Jurisdiction. (i) This EULA is governed by the laws of Canada and the province of<br>Ontario; and (ii) You expressly acknowledge and agree that this EULA and any claim and/or<br>dispute of any sort which may arise between you and the Owner is subject to the exclusive<br>jurisdiction of the federal courts and provincial courts within the jurisdiction of Ontario,<br>including but not limited to: (1) any complaint or any claim or dispute with the Owner resulting<br>from or related in any way to this EULA; (2) the use you make of the Product; or, (3) any<br>complaint concerning the Owner and/or its affiliated companies and subsidiaries and their<br>respective employees, subcontractors, managers, directors, officers, authorized representatives<br>and/or agents, vendors and content suppliers. You further accept and freely consent to the<br>exercising of territorial jurisdiction in said courts regardless to principles of conflict of laws and<br>regardless of your location, and consent to resolution of any claim or dispute by a court located<br>in London, Ontario, Canada (or closest appellate level court), and waive all defenses of lack of<br>personal jurisdiction and forum non conveniens with respect to venue and/or jurisdiction.<br><br>8.5 Assignment. The Owner may assign or delegate this EULA and/or the Privacy Policy and/or<br>Terms of Use, in whole or part, to any person or legal entity at any time with or without your<br>consent. You may not assign or delegate any rights or obligations under this EULA, the Privacy<br>Policy and/or the Terms of Use without the Owner’s prior written consent, and any<br>unauthorized assignment and/or delegation by You is ineffective.<br><br>For any questions concerning this EULA, you may contact the Owner at the following address:<br><br><a href=\"mailto:info@bravethevault.com\">info@bravethevault.com</a>.<br><br>THIS EULA IS APPLICABLE TO THE EXTENT AUTHORIZED BY LAW.","linux_requirements":[],"mac_requirements":[],"name":"Vault: Tomb of the King Demo","package_groups":[],"pc_requirements":{"minimum":"<strong>Minimum:</strong><br><ul class=\"bb_ul\"><li><strong>OS *:</strong> Microsoft Windows XP or Higher<br></li><li><strong>Processor:</strong> 1.2 GHz<br></li><li><strong>Memory:</strong> 512 MB RAM<br></li><li><strong>Graphics:</strong> DirectX 8-compatible graphics card with at least 32MB of video memory<br></li><li><strong>DirectX:</strong> Version 9.0c<br></li><li><strong>Storage:</strong> 250 MB available space</li></ul>"},"platforms":{"linux":false,"mac":false,"windows":true},"publishers":["Erich Preston"],"ratings":null,"release_date":{"coming_soon":false,"date":"27 Mar, 2020"},"required_age":0,"reviews":"“Vault is shaping up to be a promising game.”<br>PC Gamer<br>","screenshots":[{"id":0,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_f7a119dc7c5d1ab9dc3680bc06069d53462b3bdd.1920x1080.jpg?t=1585315773","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_f7a119dc7c5d1ab9dc3680bc06069d53462b3bdd.600x338.jpg?t=1585315773"},{"id":1,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_da939ea5d757ab6f80cef3c3e2302458e025ffde.1920x1080.jpg?t=1585315773","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_da939ea5d757ab6f80cef3c3e2302458e025ffde.600x338.jpg?t=1585315773"},{"id":2,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_d0c6aeffd2a1a4479f8117cfa9f0e1e6e1e53496.1920x1080.jpg?t=1585315773","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_d0c6aeffd2a1a4479f8117cfa9f0e1e6e1e53496.600x338.jpg?t=1585315773"},{"id":3,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_69f5e146f670ed119b9e615e6fdfdbb3b8991fde.1920x1080.jpg?t=1585315773","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_69f5e146f670ed119b9e615e6fdfdbb3b8991fde.600x338.jpg?t=1585315773"},{"id":4,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_7d469fb6a3c492d755a0ecbf5c079a4a446607dd.1920x1080.jpg?t=1585315773","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_7d469fb6a3c492d755a0ecbf5c079a4a446607dd.600x338.jpg?t=1585315773"},{"id":5,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_1598ac45eb0959bb6226762848cb7837cdb77c5c.1920x1080.jpg?t=1585315773","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_1598ac45eb0959bb6226762848cb7837cdb77c5c.600x338.jpg?t=1585315773"},{"id":6,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_09804c7d6d8b546af63cb0f193a46b7518203d24.1920x1080.jpg?t=1585315773","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1252500/ss_09804c7d6d8b546af63cb0f193a46b7518203d24.600x338.jpg?t=1585315773"}],"short_description":"Vault: Tomb of the King is an action-puzzle dungeon crawler.","steam_appid":1252500,"support_info":{"email":"info@bravethevault.com","url":"http://www.bravethevault.com"},"supported_languages":"English<strong>*</strong>, French, Portuguese - Brazil, Spanish - Latin America<br><strong>*</strong>languages with full audio support","type":"demo","website":"http://www.bravethevault.com"}