{"about_the_game":"<p class=\"bb_paragraph\"><i>Athena Crisis</i> is a modern retro turn-based strategy game that presents multiple gripping single-player campaigns alongside sync and async online multiplayer, as well as a full map and campaign editor, leaderboards, player skills and unit powers. Fans of <i>Advance Wars</i> or <i>Fire Emblem</i> will feel right at home in <i>Athena Crisis</i>!</p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\">Victory in <i>Athena Crisis</i> can be obtained in multiple ways: defeat all enemy units to clear a map, take over your opponent’s structures and bases, escort units to an escape zone, or simply survive for a period of time against overwhelming odds. Outwit, outbuild, and outfight your opponents to become the best Athena Crisis player.</p><p class=\"bb_paragraph\"></p><h2 class=\"bb_tag\">Take Command</h2><p class=\"bb_paragraph\">Command 40+ infantry, ground, naval, air and special units in turn-based battles. Seamlessly convert single-player games into multiplayer by activating Power Crystals that allow friends to join for coop. But beware: Activating crystals might mean other players will invade and battle you!</p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/extras/009_ATHENA_CRISIS_GIFS_WIDE_01_NO_LOGO_185.gif?t=1737001405\" /></p><h2 class=\"bb_tag\">Think Tactically</h2><p class=\"bb_paragraph\">Beware the fog! Proceeding too far behind enemy lines may leave your units exposed to attacks from unexpected directions, or even at risk of…dinosaur munches? Strategic thinking will be required to take advantage of terrain and lines of sight.</p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/extras/009_ATHENA_CRISIS_GIFS_WIDE_02_NO_LOGO_RE-SIZE.gif?t=1737001405\" /></p><h2 class=\"bb_tag\">Skills and Powers</h2><p class=\"bb_paragraph\">Customize your gameplay experience with unique unlockable skills and powers: Unlock new units, apply status effects or completely change how some unit mechanics work. And when you need to gain the upper hand, activate powers to unleash devastating counter attacks.</p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/extras/Powers2.gif?t=1737001405\" /></p><h2 class=\"bb_tag\">Just One More Game</h2><p class=\"bb_paragraph\">A lighthearted, humorous story full of memorable characters will keep you playing long past when you planned to put your Steam Deck down. Just…one…more…map… And when you run out of official content, there are hours of community created campaigns and maps to play through!</p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/extras/009_ATHENA_CRISIS_GIFS_WIDE_03_NO_LOGO_RE-SIZE.gif?t=1737001405\" /></p><h2 class=\"bb_tag\">Make Your Own Maps And Campaigns</h2><p class=\"bb_paragraph\">A full map and campaign editor is included, allowing you to customize your own campaigns with your own dialogue or make challenging encounters for your friends to overcome. You can make single maps to play with friends and other community members, or create complete campaigns with entirely new dialogue and stories.</p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/extras/009_ATHENA_CRISIS_GIFS_WIDE_04_NO_LOGO_RE-SIZE.gif?t=1737001405\" /></p><h2 class=\"bb_tag\">Play On The Go</h2><p class=\"bb_paragraph\"><i>Athena Crisis</i> takes the phrase “multi-platform” to a whole new level: you can start a game on PC or Mac and seamlessly continue it on iPhone, Android, or Steam Deck, whether you’re playing the lengthy single-player campaign or an online skirmish with your friends. </p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/extras/009_ATHENA_CRISIS_GIFS_WIDE_05_NO_LOGO_RE-SIZE.gif?t=1737001405\" /></p><h2 class=\"bb_tag\">Key Features</h2><ul class=\"bb_ul\"><li><p class=\"bb_paragraph\">Immerse yourself in a single-player campaign with funny &amp; memorable characters</p></li><li><p class=\"bb_paragraph\">Over 30 hours of official and community created content</p></li><li><p class=\"bb_paragraph\">Create your own maps and campaigns and share them with friends</p></li><li><p class=\"bb_paragraph\">Compete online in sync or async, ranked or casual battles with up to 7 players at once</p></li><li><p class=\"bb_paragraph\">Explore seven environments with unique playstyles</p></li><li><p class=\"bb_paragraph\">Compare your scores with other players in online leaderboards</p></li><li><p class=\"bb_paragraph\">Play on Windows, macOS, iPhone, iPad, Android, Linux or Steam Deck, seamlessly transitioning your progress between all of your devices</p></li><li><p class=\"bb_paragraph\">Full-length original soundtrack</p></li></ul>","background":"https://store.akamai.steamstatic.com/images/storepagebackground/app/2456430?t=1737001405","background_raw":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/page_bg_raw.jpg?t=1737001405","capsule_image":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/capsule_231x87.jpg?t=1737001405","capsule_imagev5":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/capsule_184x69.jpg?t=1737001405","categories":[{"description":"Single-player","id":2},{"description":"Multi-player","id":1},{"description":"PvP","id":49},{"description":"Online PvP","id":36},{"description":"Co-op","id":9},{"description":"Online Co-op","id":38},{"description":"Cross-Platform Multiplayer","id":27},{"description":"Full controller support","id":28},{"description":"Family Sharing","id":62}],"content_descriptors":{"ids":[],"notes":null},"controller_support":"full","detailed_description":"<p class=\"bb_paragraph\"><i>Athena Crisis</i> is a modern retro turn-based strategy game that presents multiple gripping single-player campaigns alongside sync and async online multiplayer, as well as a full map and campaign editor, leaderboards, player skills and unit powers. Fans of <i>Advance Wars</i> or <i>Fire Emblem</i> will feel right at home in <i>Athena Crisis</i>!</p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\">Victory in <i>Athena Crisis</i> can be obtained in multiple ways: defeat all enemy units to clear a map, take over your opponent’s structures and bases, escort units to an escape zone, or simply survive for a period of time against overwhelming odds. Outwit, outbuild, and outfight your opponents to become the best Athena Crisis player.</p><p class=\"bb_paragraph\"></p><h2 class=\"bb_tag\">Take Command</h2><p class=\"bb_paragraph\">Command 40+ infantry, ground, naval, air and special units in turn-based battles. Seamlessly convert single-player games into multiplayer by activating Power Crystals that allow friends to join for coop. But beware: Activating crystals might mean other players will invade and battle you!</p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/extras/009_ATHENA_CRISIS_GIFS_WIDE_01_NO_LOGO_185.gif?t=1737001405\" /></p><h2 class=\"bb_tag\">Think Tactically</h2><p class=\"bb_paragraph\">Beware the fog! Proceeding too far behind enemy lines may leave your units exposed to attacks from unexpected directions, or even at risk of…dinosaur munches? Strategic thinking will be required to take advantage of terrain and lines of sight.</p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/extras/009_ATHENA_CRISIS_GIFS_WIDE_02_NO_LOGO_RE-SIZE.gif?t=1737001405\" /></p><h2 class=\"bb_tag\">Skills and Powers</h2><p class=\"bb_paragraph\">Customize your gameplay experience with unique unlockable skills and powers: Unlock new units, apply status effects or completely change how some unit mechanics work. And when you need to gain the upper hand, activate powers to unleash devastating counter attacks.</p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/extras/Powers2.gif?t=1737001405\" /></p><h2 class=\"bb_tag\">Just One More Game</h2><p class=\"bb_paragraph\">A lighthearted, humorous story full of memorable characters will keep you playing long past when you planned to put your Steam Deck down. Just…one…more…map… And when you run out of official content, there are hours of community created campaigns and maps to play through!</p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/extras/009_ATHENA_CRISIS_GIFS_WIDE_03_NO_LOGO_RE-SIZE.gif?t=1737001405\" /></p><h2 class=\"bb_tag\">Make Your Own Maps And Campaigns</h2><p class=\"bb_paragraph\">A full map and campaign editor is included, allowing you to customize your own campaigns with your own dialogue or make challenging encounters for your friends to overcome. You can make single maps to play with friends and other community members, or create complete campaigns with entirely new dialogue and stories.</p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/extras/009_ATHENA_CRISIS_GIFS_WIDE_04_NO_LOGO_RE-SIZE.gif?t=1737001405\" /></p><h2 class=\"bb_tag\">Play On The Go</h2><p class=\"bb_paragraph\"><i>Athena Crisis</i> takes the phrase “multi-platform” to a whole new level: you can start a game on PC or Mac and seamlessly continue it on iPhone, Android, or Steam Deck, whether you’re playing the lengthy single-player campaign or an online skirmish with your friends. </p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/extras/009_ATHENA_CRISIS_GIFS_WIDE_05_NO_LOGO_RE-SIZE.gif?t=1737001405\" /></p><h2 class=\"bb_tag\">Key Features</h2><ul class=\"bb_ul\"><li><p class=\"bb_paragraph\">Immerse yourself in a single-player campaign with funny &amp; memorable characters</p></li><li><p class=\"bb_paragraph\">Over 30 hours of official and community created content</p></li><li><p class=\"bb_paragraph\">Create your own maps and campaigns and share them with friends</p></li><li><p class=\"bb_paragraph\">Compete online in sync or async, ranked or casual battles with up to 7 players at once</p></li><li><p class=\"bb_paragraph\">Explore seven environments with unique playstyles</p></li><li><p class=\"bb_paragraph\">Compare your scores with other players in online leaderboards</p></li><li><p class=\"bb_paragraph\">Play on Windows, macOS, iPhone, iPad, Android, Linux or Steam Deck, seamlessly transitioning your progress between all of your devices</p></li><li><p class=\"bb_paragraph\">Full-length original soundtrack</p></li></ul>","developers":["Nakazawa Tech"],"dlc":[2821150],"genres":[{"description":"Indie","id":"23"},{"description":"Strategy","id":"2"}],"header_image":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/header.jpg?t=1737001405","is_free":false,"legal_notice":"<h2 class=\"bb_tag\">Athena Crisis & Nakazawa Tech has Terms of Service. Please see the link below for more information: </h2>Terms of Service.<h2 class=\"bb_tag\"><strong><u>Null Games End User License Agreement</u></strong></h2>Last Updated: [September 23rd, 2024]<br><br>This End User License Agreement (this “EULA”) provides the terms and conditions under which you are authorized to access, install and/or use the Null Games Program published by Null Games Inc. (“Null Games”).<br><br>YOU MUST CAREFULLY READ THIS EULA BEFORE PURCHASING, DOWNLOADING, OR INSTALL THE NULL GAMES PROGRAM. NULL GAMES PROVIDES THE NULL GAMES PROGRAM SOLELY ON THE TERMS AND CONDITIONS SET FORTH IN THIS EULA AND ON THE CONDITION THAT YOU ACCEPT AND COMPLY WITH THIS EULA. BY CLICKING THE \"ACCEPT\" BUTTON YOU (A) ACCEPT THIS EULA AND AGREE THAT TO BE LEGALLY BOUND BY ITS TERMS; AND (B) REPRESENT AND WARRANT THAT: (I) YOU ARE 18 YEARS OF AGE OR OLDER/OF LEGAL AGE TO ENTER INTO A BINDING AGREEMENT. <br>IF YOU DO NOT AGREE TO THE TERMS OF THIS EULA, AS WELL AS THE SPECIFIC TERMS OF USE WHERE APPLICABLE, YOU ARE NOT AUTHORIZED TO DOWNLOAD OR INSTALL THE NULL GAMES PROGRAM.<h2 class=\"bb_tag\">Definitions</h2>. <br>For purposes of this EULA, the following terms have the following meanings:<br>“<strong>Intellectual Property Rights</strong>” means any and all registered and unregistered rights granted, applied for, or otherwise now or hereafter in existence under or related to any patent, copyright, trademark, trade secret, database protection, or other intellectual property rights laws, and all similar or equivalent rights or forms of protection, in any part of the world.<br>“<strong>Null Games Program</strong>” refers to: any video game published by Null Games: game software, all of their components (including in particular characters, scenario, universe, computer codes, images, animations, videos, music, text, etc.), any downloadable content for said games (including but not limited to DLC, expansion pack, battle pass, add-ons, add-on software, any other game extension, etc.), as well as their documentation. <br>“<strong>Person</strong>” means an individual, corporation, partnership, joint venture, limited liability company, governmental authority, unincorporated organization, trust, association, or other entity.<br>“<strong>Platform</strong>” means the online sales platform on which you have purchased the Null Games Program. The provisions applicable to the contract of sale of the Null Games Program between the Platform and you, in particular in terms of legal guarantee of compliance, guarantee against hidden defects, right of withdrawal, and updates must be communicated to you by the Platform.<br>“<strong>Third Party</strong>” means any Person other than you or Null Games.<h2 class=\"bb_tag\">License Grant and Scope. </h2>Subject to and conditioned upon your compliance with all terms and conditions set forth in this EULA, Null Games hereby grants you a non-exclusive, non-sublicensable, non-transferable, license, to: download, install, display and use one (1) copy of the Null Games Program for personal, non-commercial use on one (1) device that you own or lease, and control. This EULA is strictly limited to the Null Games Program, to the exclusion of any remastered version, any remake or reboot, any sequel (e.g., any prequel, spin-off), any port, or any other separate version of the Null Games Program.<h2 class=\"bb_tag\">Use Restrictions. You shall not, directly or indirectly:</h2><ul class=\"bb_ul\"><li>use (including make any copies of) the Null Games Program beyond the scope of the license granted under 2;<br></li><li>provide any other Person with access to or use of the Null Games Program;<br></li><li>modify, translate, adapt, or otherwise create derivative works or improvements of the Null Games Program or any part thereof;<br></li><li>combine the Null Games Program or any part thereof with, or incorporate the Null Games Program or any part thereof in, any other programs;<br></li><li>reverse engineer, disassemble, decompile, decode, or otherwise attempt to derive or gain access to the source code of the Null Games Program or any part thereof;<br></li><li>remove, delete, alter, or obscure any trademarks or any copyright, trademark, patent, or other intellectual property or proprietary rights notices provided on or with the Null Games Program, including any copy thereof;<br></li><li>except as expressly set forth in Section 2, copy the Null Games Program, in whole or in part;<br></li><li>rent, lease, lend, sell, sublicense, assign, distribute, publish, transfer, or otherwise make available the Null Games Program, or any features or functionality of the Null Games Program, to any Third Party for any reason, whether or not over a network or on a hosted basis, including in connection with the internet or any web hosting, wide area network (WAN), virtual private network (VPN), virtualization, time-sharing, service bureau, software as a service, cloud, or other technology or service;<br></li><li>use the Null Games Program in violation of any law, regulation, or rule; <br></li><li>use the Null Games Program for purposes of competitive analysis of the Null Games Program, the development of a competing software product or service, or any other purpose that is to the Null Games’ commercial disadvantage;<br></li><li>Use any Third Party software not expressly authorized by Null Games that interacts with the Null Games Program, regardless of the purpose;<br></li><li>Use the Null Games Program or allow the use of the Null Games Program on several computers, games consoles, handhelds, mobile devices or other devices at the same time, without an additional license (this license may be provided by an authorized Third Party (for example a Platform), provided that you have accepted the terms and conditions of sale or service); or<br></li><li>Use the Null Games Program or allow the use of the Null Game Program in a network, as part of a multi-user system or a remote access system, including any online use, unless otherwise expressly stipulated by Null Games and subject to the acceptance of the terms and conditions of use of the Null Games Program.<h2 class=\"bb_tag\">Technical Protection Measures. </h2>The Null Games Program may contain technological copy protection or other security features designed to prevent unauthorized use of the Null Games Program, including features to protect against any use of the Null Games Program that is prohibited under this EULA. You shall not, and shall not attempt to, remove, disable, circumvent, or otherwise create or implement any workaround to, any such copy protection or security features.<br>In connection with the technological copy protection and other security features designed or used by Null Games under this EULA, you acknowledge that:<br>The number of installations or activations of the Null Games Program may be limited;<br>Certain files and/or data may be downloaded to your device and certain information may be collected for the sole purpose of authenticating the Null Games Program; and<br>An internet connection may be required.<br>Additional information may be communicated to you by the Platform and the Platform may have its own technological copy protection mechanisms. <br>Null Games’ remedies set forth in this EULA are cumulative and are in addition to, and not in lieu of, all other remedies Null Games may have at law or in equity, whether under this EULA or otherwise.<h2 class=\"bb_tag\">Intellectual Property Rights.</h2> The Null Games Program is provided under license and is not sold to you. You do not acquire any ownership interest in the Null Games Program or under this EULA, or any other rights thereto, other than to use the same in accordance with the license granted and subject to all terms, conditions, and restrictions under this EULA. Null Games and its licensors and service providers reserves and shall retain their entire right, title, and interest in and to the Null Games Program and all Intellectual Property Rights arising out of or relating to the Null Games Program, except as expressly granted to you in this EULA.<h2 class=\"bb_tag\">Third Party Materials.</h2>The Null Games Program may contain elements, assets, Intellectual property Rights, or other materials licensed by Null Games from a Third Party. As such, our Third Party licensors may take all measures they deem necessary to asset their rights in the event you breach this EULA or the terms and conditions specific to such Third Party’s materials. <br>This Party tools, software, assets, Intellectual Property Rights and other materials (collectively, “Third Party Materials”) have been used in the development of the Null Games Program and/or are likely to be integrated into the Null Games Program. Third Party Materials may also be made available to you to enable your use of the Null Games Program to certain features therein. All rights to the Third Party Materials are reserved and remain the full property of the relevant Third Party. Nothing in this EULA has the purpose r effect of transferring to you any right, title or interest in or to the Third Party Materials. By accepting this EULA, you accept the specific terms and conditions of all Third Party Materials. In the event of inconsistency or contradiction between the provisions relating to a Third Party Materials contained in the terms of this EULA and in the specific terms and conditions of said Third Party Materials, the specific provisions of the latter shall prevail over that of this EULA with regard to the aforementioned Third Party Materials.<h2 class=\"bb_tag\">Updates, Patches, Modifications.</h2>Null Games, or a Third party authorized by Null Games, may make improvements, updates, modifications, corrects, patches or corrections (collectively, “Updates”) to the Null Games Programs from time to time. Null Games reserves the right to modify the Null Games Program code at any time at its sole discretion. Such modifications may have an impact on the functionality of the Null Games Program or its content (e.g. adding or removing features or content, fixing bugs or errors, modifications intended for balancing the game, etc.). <br>The information relating to the nature of these Updates and the duration for which these Updates are available for download are communicated to you by the Platform in the general conditions of sale made available by the Platform or any other contractual document of its choice. Information relating to the essential characteristics of each Update (i.e. purpose of the Update, version of the operating system of the Hardware concerned by the Update, storage space required, possible consequences of the Update on the functioning of the Null Games Program) is communicated to you before downloading the Update. You will also be informed by the Platform if the Update is necessary to maintain the compliance of the Null Games Program and why. Null Games strongly encourages you to download and install all Updates necessary to maintain the compliance of the Null Games Program and cannot be held responsible in the event of malfunction of the Null Games Program resulting from the failure to download and install this type of Update.<h2 class=\"bb_tag\">User-Generated Conduct. </h2>Certain Null Games Programs may allow you, by means of tools or Third Party Materials made available by Null Games or our licensors to choose a pseudonym, create an avatar, exchange and communicate with other players, transmit and share messages, sounds, voices, recordings, texts, images, drawings, photos, documents as well as create and customize games, levels, maps, scenarios, and any other content (hereinafter “User Content”), which may be used and shared as part of the Null Games Program. User Content may be a creation of your imagination or a creation made from pre-existing creations, to which Null Games and its licensors may have rights.<br>When the Null Games Program allows the sharing of User Content or interaction with other Third Party websites and/or online services (“Third Party Sites”), you agree to comply with the conditions of use of the Third Party Sites in question. Null Games is not responsible for the content or your interactions with any Third Party Sites. The links made available to you are for convenience, without the liability of Null Games being engaged in this respect. It is your responsibility to ensure that you comply with the conditions of use of the Third Party Sites and that they are appropriate for your profile. You agree to indemnify, defend and hold harmless Null Games from all liability relating to a possible violation of the conditions of use of any Third Party Sites site by you, as well as all damages, direct or indirect, which could result from it. <br>You are solely responsible for the use and sharing of the User Content that you create and must in any event comply with the terms of this EULA when creating/using/sharing any User Content. Null Games can in no way be held responsible, without any limitation: for any alteration of the quality of the Null Games Program, for any alteration or loss of one of your User Content during the creation/use/sharing of any user Content, or for the infringement of an intellectual property right held by a Third Party.<br>To the fullest extent permitted by applicable law, you hereby grant Null Games and its licensors a non-exclusive license, free of charge, for the entire world, and where applicable for the duration of the rights, irrevocable, fully transferable and sub-licensable, in any way whatsoever, of your User Content and your contributions to them, as they are created and/or shared, including, but not limited to, the rights to use, copy, modify, reproduce in whole or in part, adapt, evolve, translate, carry on any medium, incorporate in other works, extract elements in whole or in part and/or add elements and remove, distribute, display, publish, communicate in any way whatsoever, distribute, sell and market the User Content, without any restriction, on all media, formats and forms, currently known or subsequently designed, which may be licensed, transferred, rented, made available to the public, or performed publicly and globally, without any prior notice or compensation.<br>Notwithstanding the foregoing, you acknowledge and agree that all or portions of the User Content that you create may include content, goods and materials owned by Null Games and/or its licensors. Such user Content are derivative works of pre-existing works whose rights are owned by Null Games or its Licensors. Nothing in this EULA, or any other document applicable to this contractual relationship, grants or bestows on you an assignment or transfer of rights (including any Intellectual Property Rights) to these pre-existing works used to create such User Content, which shall remain the property of Null Games and its licensors. As a result, User Content resulting from pre-existing creations may not be used without the express authorization of Null Games and/or its licensors.<h2 class=\"bb_tag\">Term and Termination.</h2>This EULA and the license granted hereunder shall remain in effect until  terminated as set forth herein (the “Term”).<br>You may terminate this EULA by removing or uninstalling and ceasing to use all copies of the Null Games Program from your device. <br>Null Games may terminate this EULA, effective upon notice to you, if you,  breach any terms of this EULA and such breach: (i) is incapable of cure; or (ii) being capable of cure, remains uncured for twenty-four (24) hours after Null Games provides written notice thereof.<h2 class=\"bb_tag\">Limited Warranties, Exclusive Remedy, and Disclaimer/Warranty Disclaimer.</h2>THE NULL GAMES PROGRAM IS PROVIDED TO YOU \"AS IS\" AND WITH ALL FAULTS AND DEFECTS WITHOUT WARRANTY OF ANY KIND. TO THE MAXIMUM EXTENT PERMITTED UNDER APPLICABLE LAW, NULL GAMES, ON ITS OWN BEHALF AND ON BEHALF OF ITS AFFILIATES AND ITS AND THEIR RESPECTIVE LICENSORS AND SERVICE PROVIDERS, EXPRESSLY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE, WITH RESPECT TO THE NULL GAMES PROGRAM, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND WARRANTIES THAT MAY ARISE OUT OF COURSE OF DEALING, COURSE OF PERFORMANCE, USAGE, OR TRADE PRACTICE. WITHOUT LIMITATION TO THE FOREGOING, NUL GAMES PROVIDES NO WARRANTY OR UNDERTAKING, AND MAKES NO REPRESENTATION OF ANY KIND THAT THE NULL GAMES PROGRAM WILL MEET YOR REQUIREMENTS, ACHIEVE ANY INTENDED RESULTS, BE COMPATIBLE, OR WORK WITH ANY OTHER SOFTWARE, APPLICATIONS, SYSTEMS, OR SERVICES, OPERATE WITHOUT INTERRUPTION, MEET ANY PERFORMANCE OR RELIABILITY STANDARDS OR BE ERROR FREE, OR THAT ANY ERRORS OR DEFECTS CAN OR WILL BE CORRECTED.<h2 class=\"bb_tag\">Limitation of Liability. </h2>TO THE FULLEST EXTENT PERMITTED UNDER APPLICABLE LAW:<br>IN NO EVENT WILL NULL GAMES OR ITS AFFILIATES, OR ANY OF ITS OR THEIR RESPECTIVE LICENSORS OR SERVICE PROVIDERS, BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY USE, INTERRUPTION, DELAY, OR INABILITY TO USE THE NULL GAMES PROGRAM; LOST REVENUES OR PROFITS; DELAYS, INTERRUPTION, OR LOSS OF SERVICES, BUSINESS, OR GOODWILL; LOSS OR CORRUPTION OF DATA; LOSS RESULTING FROM SYSTEM OR SYSTEM SERVICE FAILURE, MALFUNCTION, OR SHUTDOWN; FAILURE TO ACCURATELY TRANSFER, READ, OR TRANSMIT INFORMATION; FAILURE TO UPDATE OR PROVIDE CORRECT INFORMATION; SYSTEM INCOMPATIBILITY OR PROVISION OF INCORRECT COMPATIBILITY INFORMATION; OR BREACHES IN SYSTEM SECURITY; OR FOR ANY CONSEQUENTIAL, INCIDENTAL, INDIRECT, EXEMPLARY, SPECIAL, OR PUNITIVE DAMAGES, WHETHER ARISING OUT OF OR IN CONNECTION WITH THIS EULA, BREACH OF CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE, REGARDLESS OF WHETHER SUCH DAMAGES WERE FORESEEABLE AND WHETHER OR NOT YOU WERE ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.<br>IN NO EVENT WILL NULL GAMES AND ITS AFFILIATES', INCLUDING ANY OF ITS OR THEIR RESPECTIVE LICENSORS' AND SERVICE PROVIDERS', COLLECTIVE AGGREGATE LIABILITY UNDER OR IN CONNECTION WITH THIS EULA OR ITS SUBJECT MATTER, UNDER ANY LEGAL OR EQUITABLE THEORY, INCLUDING BREACH OF CONTRACT, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY, AND OTHERWISE, EXCEED THE TOTAL AMOUNT PAID TO NULL GAMES PURSUANT IN CONNECTION WIH YOUR PURCHASE OF THE NULL GAMES PROGRAM.<h2 class=\"bb_tag\">Export Regulation.</h2> The Null Games Program may be subject to US export control laws, including the Export Control Reform Act and its associated regulations. You shall not, directly or indirectly, export, re-export, or release the Null Games Program to, or make the Null Games Program accessible from, any jurisdiction or country to which export, re-export, or release is prohibited by law, rule, or regulation. You shall comply with all applicable federal laws, regulations, and rules, and complete all required undertakings (including obtaining any necessary export license or other governmental approval), prior to exporting, re-exporting, releasing, or otherwise making the Null Games Program available outside the US.<h2 class=\"bb_tag\">General</h2>.All matters arising out of or relating to this EULA shall be governed by and construed in accordance with the internal laws of the State of California without giving effect to any choice or conflict of law provision or rule. Any legal suit, action, or proceeding arising out of or relating to this EULA or the transactions contemplated hereby shall be instituted in the federal courts of the United States of America or the courts of the State of California, and each party irrevocably submits to the exclusive jurisdiction of such courts in any such legal suit, action, or proceeding. Service of process, summons, notice, or other document by mail to such party's address set forth herein shall be effective service of process for any suit, action, or other proceeding brought in any such court.<br>In no event shall Null Games be liable to you or be deemed to have breached this EULA, for any failure or delay in performing its obligations under this EULA, if and to the extent such failure or delay is caused by any circumstances beyond Null Games’ reasonable control, including but not limited to: (i) acts of God; (ii) flood, fire, earthquake, or explosion; (iii) war, invasion, hostilities (whether war is declared or not), terrorist threats or acts, riot or other civil unrest; (iv) government order, law, or actions; (v) embargoes or blockades in effect on or after the date of this EULA; (vi) national or regional emergency;  (vii) strikes, labor stoppages or slowdowns, or other industrial disturbances; and(viii) shortage of adequate power or transportation facilities.<br>This EULA, and all other documents that are incorporated by reference herein, constitutes the sole and entire agreement between Null Games and you with respect to the subject matter contained herein, and supersedes all prior and contemporaneous understandings, agreements, representations, and warranties, both written and oral, with respect to such subject matter. <br>This EULA, and any rights and licenses granted hereunder, may not be transferred or assigned by you without Null Games’ prior express written consent, but may be assigned by Null Games without restriction.  Any attempted transfer or assignment in violation hereof will be null and void.<br>This EULA is for the sole benefit of the parties hereto and their respective successors and permitted assigns and nothing herein, express or implied, is intended to or shall confer on any other Person any legal or equitable right, benefit, or remedy of any nature whatsoever under or by reason of this EULA.<br>Null Games may provide notifications, whether such notifications are required by applicable law or are for marketing or other business-related purposes, to you via email notice or written or hard copy notice, or through posting of such notice on our website or as permitted through the Platform, as we determine, in our sole discretion.  We reserve the right to determine the form and means of providing notifications to you and our players, provided that you may opt out of certain means of notification, as required under applicable law or as described in this EULA.  We are not responsible for any automatic filtering you or your network provider may apply to email notifications we send to the email address you provide us.  We may, in our sole discretion, modify or update this EULA from time to time, and so you should review this page periodically.  When we change this EULA in a material manner, we will update the ‘last modified’ date at the top of this page and notify you that material changes have been made to this EULA.  This EULA applies to and governs your access to and use of the Null Games Program effective as of the start of your access to the Null Games Program, even if such access began before publication of this EULA.  Your continued use of the Null Games Program after any change to this EULA constitutes your acceptance of the new EULA. <br><br>If any term or provision of this EULA is invalid, illegal, or unenforceable in any jurisdiction, such invalidity, illegality, or unenforceability shall not affect any other term or provision of this EULA or invalidate or render unenforceable such term or provision in any other jurisdiction.<br><br>For purposes of this EULA, (a) the words \"include,\" \"includes,\" and \"including\" shall be deemed to be followed by the words \"without limitation\"; (b) the word \"or\" is not exclusive; and (c) the words \"herein,\" \"hereof,\" \"hereby,\" \"hereto,\" and \"hereunder\" refer to this EULA as a whole. Unless the context otherwise requires, references herein: (y) to an agreement, instrument, or other document means such agreement, instrument, or other document as amended, supplemented, and modified from time to time to the extent permitted by the provisions thereof and (z) to a statute means such statute as amended from time to time and includes any successor legislation thereto and any regulations promulgated thereunder. This EULA shall be construed without regard to any presumption or rule requiring construction or interpretation against the party drafting an instrument or causing any instrument to be drafted. <br><br>The headings in this EULA are for reference only and do not affect the interpretation of this EULA.</li></ul>","linux_requirements":{"minimum":"<strong>Minimum:</strong><br><ul class=\"bb_ul\"><li><strong>OS:</strong> 2020 release or above<br></li><li><strong>Processor:</strong> Intel i3 or equivalent<br></li><li><strong>Memory:</strong> 4 GB RAM<br></li><li><strong>Graphics:</strong> Integrated Graphics<br></li><li><strong>Network:</strong> Broadband Internet connection<br></li><li><strong>Storage:</strong> 500 MB available space</li></ul>","recommended":"<strong>Recommended:</strong><br><ul class=\"bb_ul\"><li><strong>Processor:</strong> Intel i5 or equivalent<br></li><li><strong>Memory:</strong> 8 GB RAM<br></li><li><strong>Graphics:</strong> NVIDIA GeForce GTX 660 or equivalent<br></li><li><strong>Network:</strong> Broadband Internet connection<br></li><li><strong>Storage:</strong> 500 MB available space</li></ul>"},"mac_requirements":{"minimum":"<strong>Minimum:</strong><br><ul class=\"bb_ul\"><li><strong>OS:</strong> 11.0.0<br></li><li><strong>Processor:</strong> Apple M1 or Intel Core M<br></li><li><strong>Memory:</strong> 4 GB RAM<br></li><li><strong>Graphics:</strong> Integrated Graphics<br></li><li><strong>Network:</strong> Broadband Internet connection<br></li><li><strong>Storage:</strong> 500 MB available space</li></ul>","recommended":"<strong>Recommended:</strong><br><ul class=\"bb_ul\"><li><strong>OS:</strong> 11.0.0<br></li><li><strong>Processor:</strong> Apple M1+<br></li><li><strong>Memory:</strong> 8 GB RAM<br></li><li><strong>Graphics:</strong> Apple M series Integrated Graphics<br></li><li><strong>Network:</strong> Broadband Internet connection<br></li><li><strong>Storage:</strong> 500 MB available space</li></ul>"},"metacritic":{"score":83,"url":"https://www.metacritic.com/game/pc/athena-crisis?ftag=MCD-06-10aaa1f"},"movies":[{"highlight":true,"id":257057426,"mp4":{"480":"http://video.akamai.steamstatic.com/store_trailers/257057426/movie480.mp4?t=1728577624","max":"http://video.akamai.steamstatic.com/store_trailers/257057426/movie_max.mp4?t=1728577624"},"name":"Launch Trailer","thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/257057426/6e96df0db5196890e057a3ea55716a9514c22f97/movie_600x337.jpg?t=1728577624","webm":{"480":"http://video.akamai.steamstatic.com/store_trailers/257057426/movie480_vp9.webm?t=1728577624","max":"http://video.akamai.steamstatic.com/store_trailers/257057426/movie_max_vp9.webm?t=1728577624"}},{"highlight":true,"id":257063531,"mp4":{"480":"http://video.akamai.steamstatic.com/store_trailers/257063531/movie480.mp4?t=1728577630","max":"http://video.akamai.steamstatic.com/store_trailers/257063531/movie_max.mp4?t=1728577630"},"name":"Accolades Trailer","thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/257063531/eefc8b6f7a79235c65a6da6636dd5a5f15703e3e/movie_600x337.jpg?t=1728577630","webm":{"480":"http://video.akamai.steamstatic.com/store_trailers/257063531/movie480_vp9.webm?t=1728577630","max":"http://video.akamai.steamstatic.com/store_trailers/257063531/movie_max_vp9.webm?t=1728577630"}},{"highlight":false,"id":257005361,"mp4":{"480":"http://video.akamai.steamstatic.com/store_trailers/257005361/movie480.mp4?t=1709668425","max":"http://video.akamai.steamstatic.com/store_trailers/257005361/movie_max.mp4?t=1709668425"},"name":"Early Access Trailer","thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/257005361/movie.293x165.jpg?t=1709668425","webm":{"480":"http://video.akamai.steamstatic.com/store_trailers/257005361/movie480_vp9.webm?t=1709668425","max":"http://video.akamai.steamstatic.com/store_trailers/257005361/movie_max_vp9.webm?t=1709668425"}}],"name":"Athena Crisis","package_groups":[{"description":"","display_type":0,"is_recurring_subscription":"false","name":"default","save_text":"","selection_text":"Select a purchase option","subs":[{"can_get_free_license":"0","is_free_license":false,"option_description":"","option_text":"Athena Crisis - $19.99 USD","packageid":884089,"percent_savings":0,"percent_savings_text":" ","price_in_cents_with_discount":1999}],"title":"Buy Athena Crisis"}],"packages":[884089],"pc_requirements":{"minimum":"<strong>Minimum:</strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<br></li><li><strong>OS:</strong> 10<br></li><li><strong>Processor:</strong> Intel i5 or equivalent<br></li><li><strong>Memory:</strong> 4 GB RAM<br></li><li><strong>Graphics:</strong> Integrated Graphics<br></li><li><strong>Network:</strong> Broadband Internet connection<br></li><li><strong>Storage:</strong> 500 MB available space</li></ul>","recommended":"<strong>Recommended:</strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<br></li><li><strong>OS:</strong> 10<br></li><li><strong>Processor:</strong> Intel i5 or equivalent<br></li><li><strong>Memory:</strong> 8 GB RAM<br></li><li><strong>Graphics:</strong> NVIDIA GeForce GTX 660 or equivalent<br></li><li><strong>Network:</strong> Broadband Internet connection<br></li><li><strong>Storage:</strong> 500 MB available space</li></ul>"},"platforms":{"linux":true,"mac":true,"windows":true},"price_overview":{"currency":"USD","discount_percent":0,"final":1999,"final_formatted":"$19.99 USD","initial":1999,"initial_formatted":""},"publishers":["Null Games"],"ratings":{"dejus":{"banned":"0","descriptors":"Drogas lícitas\nViolência","rating":"12","rating_generated":"1","required_age":"12","use_age_gate":"0"},"steam_germany":{"banned":"0","descriptors":"Alkohol / Tabak\nGewalt","rating":"12","rating_generated":"1","required_age":"12","use_age_gate":"0"}},"release_date":{"coming_soon":false,"date":"23 Sep, 2024"},"required_age":0,"screenshots":[{"id":0,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_d46ad98fd26fdbed8b6b3de98676ba51ef28b4ed.1920x1080.jpg?t=1737001405","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_d46ad98fd26fdbed8b6b3de98676ba51ef28b4ed.600x338.jpg?t=1737001405"},{"id":1,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_7cfd6469d905056219a1d2675f400c6e1172f2cb.1920x1080.jpg?t=1737001405","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_7cfd6469d905056219a1d2675f400c6e1172f2cb.600x338.jpg?t=1737001405"},{"id":2,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_a131e40b3a7e35ab9d6b0e8b68fe3123ced3dd9d.1920x1080.jpg?t=1737001405","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_a131e40b3a7e35ab9d6b0e8b68fe3123ced3dd9d.600x338.jpg?t=1737001405"},{"id":3,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_2923b659667faf897ae74601bffa65f2e7fd5611.1920x1080.jpg?t=1737001405","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_2923b659667faf897ae74601bffa65f2e7fd5611.600x338.jpg?t=1737001405"},{"id":4,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_290f65b3eb32c6c903fa9d9b758842f1f0cfc247.1920x1080.jpg?t=1737001405","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_290f65b3eb32c6c903fa9d9b758842f1f0cfc247.600x338.jpg?t=1737001405"},{"id":5,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_afffdc86c731aa100ed0a29019228bae97cdaf58.1920x1080.jpg?t=1737001405","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_afffdc86c731aa100ed0a29019228bae97cdaf58.600x338.jpg?t=1737001405"},{"id":6,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_70b0fef7a79104ac5cc0f74f5a48d037902b379e.1920x1080.jpg?t=1737001405","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_70b0fef7a79104ac5cc0f74f5a48d037902b379e.600x338.jpg?t=1737001405"},{"id":7,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_e44ab39701d7ad92ed09c75290aabe297016f6a1.1920x1080.jpg?t=1737001405","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_e44ab39701d7ad92ed09c75290aabe297016f6a1.600x338.jpg?t=1737001405"},{"id":8,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_1743b8729adebe2e62b6487b4196876e0b9c18da.1920x1080.jpg?t=1737001405","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_1743b8729adebe2e62b6487b4196876e0b9c18da.600x338.jpg?t=1737001405"},{"id":9,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_ef2172196553b65016c871d85dc3af79e4b65224.1920x1080.jpg?t=1737001405","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2456430/ss_ef2172196553b65016c871d85dc3af79e4b65224.600x338.jpg?t=1737001405"}],"short_description":"Athena Crisis is a modern retro turn-based strategy game that places you in command of 40+ units in your journey across the multiverse. Embark on a challenging single-player quest or dive into the thrill of ranked or casual multiplayer modes to become the best Athena Crisis player!","steam_appid":2456430,"support_info":{"email":"support@athenacrisis.com","url":"https://athenacrisis.com"},"supported_languages":"English, German, Japanese, French, Spanish - Spain, Ukrainian, Italian, Portuguese - Portugal, Russian, Korean, Polish, Portuguese - Brazil, Simplified Chinese","type":"game","website":"https://athenacrisis.com"}