{"about_the_game":"Welcome to Two-Timin’ Towers – a tower defense game where your towers have friendly fire, turning a classic strategy game into high-intensity, bullet-hell mayhem. Control an engineer on the battlefield and build towers to defeat increasingly challenging waves of enemies, all while narrowly avoiding bullets from your own towers.<br><br>Part tower defense. Part bullet hell. All wrench-swingin’ mayhem.<br><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/extras/swing3.png?t=1723304389\" /><br><br><strong>Featuring…</strong><br><br><ul class=\"bb_ul\"><li>A loadout of powerful towers that conquer the battlefield with a wide array of firepower.<br></li><li>A diverse cast of enemies with unique abilities that keep you on your toes.<br></li><li>Life-saving power-ups to help shift the tides of battle in your favour.</li></ul><br><strong>And many game modes to test your skills:</strong><br><br><ul class=\"bb_ul\"><li></li><li><strong><u>Endless Mode:</u></strong> Clash against a never-ending onslaught of enemies and climb the competitive leaderboard.<br></li><li></li><li><strong><u>Map Maker:</u></strong> Flex your creative muscles by making your own maps and enemy waves. Or play through an ever-growing list of community maps.<br></li><li></li><li><strong><u>Story Mode:</u></strong> Enter a vibrant world filled with distinct levels, witty dialogue, and lovable character art. In the current demo, this comes to life as a short tutorial.</li></ul>","background":"https://store.akamai.steamstatic.com/images/storepagebackground/app/3113410?t=1723304389","background_raw":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/page_bg_raw.jpg?t=1723304389","capsule_image":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/capsule_231x87.jpg?t=1723304389","capsule_imagev5":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/capsule_184x69.jpg?t=1723304389","categories":[{"description":"Single-player","id":2},{"description":"Game demo","id":10},{"description":"Partial Controller Support","id":18}],"content_descriptors":{"ids":[],"notes":null},"detailed_description":"<h1>🏆 WINNER OF THE 2020 GMTK GAME JAM 🏆</h1><p><i>&quot;A tower defense game that fixes the most obvious problem with the genre.&quot;</i><br><strong>- Mark Brown, Game Maker's Toolkit</strong><br><br><i>&quot;A bonkers, out of control, bullet hell nightmare.&quot;</i><br><strong>- Mark Brown, Game Maker's Toolkit</strong></p><br><h1>About the Demo</h1>Welcome to Two-Timin’ Towers – a tower defense game where your towers have friendly fire, turning a classic strategy game into high-intensity, bullet-hell mayhem. Control an engineer on the battlefield and build towers to defeat increasingly challenging waves of enemies, all while narrowly avoiding bullets from your own towers.<br><br>Part tower defense. Part bullet hell. All wrench-swingin’ mayhem.<br><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/extras/swing3.png?t=1723304389\" /><br><br><strong>Featuring…</strong><br><br><ul class=\"bb_ul\"><li>A loadout of powerful towers that conquer the battlefield with a wide array of firepower.<br></li><li>A diverse cast of enemies with unique abilities that keep you on your toes.<br></li><li>Life-saving power-ups to help shift the tides of battle in your favour.</li></ul><br><strong>And many game modes to test your skills:</strong><br><br><ul class=\"bb_ul\"><li></li><li><strong><u>Endless Mode:</u></strong> Clash against a never-ending onslaught of enemies and climb the competitive leaderboard.<br></li><li></li><li><strong><u>Map Maker:</u></strong> Flex your creative muscles by making your own maps and enemy waves. Or play through an ever-growing list of community maps.<br></li><li></li><li><strong><u>Story Mode:</u></strong> Enter a vibrant world filled with distinct levels, witty dialogue, and lovable character art. In the current demo, this comes to life as a short tutorial.</li></ul>","developers":["TinkerTinker Games"],"fullgame":{"appid":"2229740","name":"Two-Timin' Towers"},"header_image":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/header.jpg?t=1723304389","is_free":true,"legal_notice":"End User License Agreement of Two-Timin’ Towers<br>This End User License Agreement governs the use of our application in a legally binding way. You must read this document carefully.<br><br>Our application is provided by: <br>TinkerTinker Games<br><br>Contact email: <a href=\"mailto:twotimintowers@gmail.com\">twotimintowers@gmail.com</a><br><br>This document was generated with the use of the End User License Agreement (EULA) template.<br>What you should know at a glance<br>Please note that some provisions may only apply to certain categories of users. In particular, certain provisions may only apply to consumers or to those users who do not qualify as consumers. Such limitations are always explicitly mentioned within each affected clause. In the absence of any such mention, clauses apply to all users.<br><br>TERMS OF USE<br>Unless stated otherwise, the terms in this section apply generally when using our application. <br><br>Specific or additional conditions may apply in certain situations and are noted in this document.<br><br>By using our application, you confirm the following:<br>you are not in a country under a U.S. government embargo or designated as a \"terrorist-supporting\" country;<br>you are not on any U.S. government list of prohibited or restricted parties.<br>Account registration<br>To fully use some features in our application, you can register or create an account by providing an email address. You can also use our application without an account, but this might limit some features.<br><br>You are responsible for keeping your login details confidential.<br><br>By registering, you agree to take reasonable responsibility for all activities under your username. <br>You must immediately inform us using the contact details in this document if you believe your personal information, account, or login details have been violated, disclosed, or stolen.<br>Conditions for account registration<br>Registration of accounts on our application is subject to the conditions outlined below. By registering, you agree to meet such conditions.<br>It is not permitted to register accounts by bots or any other automated methods;<br>Your account must not be shared with other persons unless otherwise specified.<br>Account termination<br>You can close your account and stop using our service anytime by contacting us at the contact details provided in this document. <br>Account suspension and deletion<br>We reserve the right to suspend or delete your account at any time and without notice if we find it inappropriate, offensive, or in violation of these terms.<br><br>Suspending or deleting accounts does not entitle you to claim for any compensation, damages, or reimbursement.<br><br>The suspension or deletion of accounts due to causes attributable to you does not exempt you from paying any applicable fees or prices, (not that we have any as a free demo).<br>Content on this application<br>Unless otherwise noted, all content on our application is owned or provided by us or our licensors.<br><br>We do our best to ensure the content on our application complies with all laws and respects third-party rights. However, this may not always be achievable. <br>If you believe your rights are being infringed, without prejudice to any legal prerogatives to enforce your rights, please report any issues using the contact details provided in this document.<br>Removal of content from parts of this application available through Steam<br>If the reported content is deemed objectionable, it will be removed and those who provided the content will be prevented from using our application.<br>Access to external resources<br>Through our application, you may access external resources provided by third parties. You acknowledge and accept that we have no control over these resources and are not responsible for their content or availability.<br><br>Conditions for third-party resources, including any rights granted in their content, are governed by those third parties' terms and conditions or by applicable law.<br>Acceptable use<br>Our application may only be used within the scope of what is provided for, under this document and applicable law.<br><br>You are solely responsible for ensuring your use of our application does not violate any laws, regulations, or third-party rights.<br><br>We reserve the right to protect our interests by denying you access to our application, terminating contracts, and reporting any misconduct to the appropriate authorities if you are involved in or suspected of the following:<br>violating laws, regulations, or these terms;<br>infringing on third-party rights;<br>significantly impairing our legitimate interests;<br>offending us or any third party.<br>Software license<br>Any intellectual or industrial property rights, as well as other exclusive rights on software or technical features related to our application, are owned by us and/or our licensors.<br><br>Provided you comply with these terms, we grant you a revocable, non-exclusive, non-sublicensable, and non-transferable license to use the software and other technical features on our application for its intended purposes.<br><br>This license does not give you any rights to access, use, or share the original source code. All techniques, algorithms, and procedures in the software and related documentation are the sole property of us or our licensors.<br><br>All rights and licenses granted to you will immediately end if the agreement is terminated or expires.<br><br>We reserve the right to release updates and improvements to our application and its related software. You may need to download and install these updates to keep using them.<br><br>Generally in a EULA, something along the lines of the following will be said,<br>“[The software licensed will be valid and functional for X amount of time since it has been made available to you, and in any case for the entire duration of the subscription, subject to the conditions of the agreement including, without limitation, any required updates. It is understood that the possible occurrence of errors and occasional technical faults is inherent to the nature of software. To the extent required under applicable law and/or the agreement, we commit to resolving possible defects and/or faults impairing the software’s functionality during the validity period, unless these result from any improper or irregular use of the software, including (without limitation) your failure to implement any required updates.]”<br>We, however, are a small indie team with no ability to make such a grand promise of exact time frames, so instead, we just make a reasonable promise that this demo will include updates and fixes as needed while we work on the game and/or demo.<br>Purchase via Steam<br>Our application or specific products available for sale may be purchased via a third-party app store. To access such purchases, you must follow the instructions provided on the relevant online store (such as \"Steam\"), which may vary depending on the particular device in use.<br>Unless otherwise specified, purchases (even free ones) done via third-party online stores are also subject to third parties’ terms and conditions, which will always prevail upon these terms in case of conflict. You must read such third-party’ terms and conditions of sale carefully and accept them.<br><br>LIABILITY AND INDEMNIFICATION<br>We limit our liability as much as legally allowed when executing agreements with you. This means our responsibility for damages is reduced to the maximum extent permitted by law unless explicitly stated otherwise or agreed upon with you.<br>Indemnification<br>You agree to indemnify us and our affiliates, officers, directors, and employees from any claims or demands made by third parties due to or in connection with any culpable violation of these terms or third-party rights related to your use of the service to the extent allowed by law.<br>Limitation of liability<br>Unless explicitly stated otherwise and subject to applicable law, you cannot claim damages against us (or any individual or entity acting on our behalf).<br><br>However, this exclusion does not apply to damages affecting life, health, or physical integrity, damages arising from the breach of significant contractual obligations (such as those necessary to fulfill the contract's purpose), and/or damages resulting from intentional or gross negligence, provided that our application has been used appropriately and correctly by you.<br><br>Unless damages stem from intentional or gross negligence, or they impact life, health, or physical integrity, our liability is limited to typical and foreseeable damages at the time the contract was entered into.<br>US users<br>Disclaimer of warranties<br>Our application is provided on an “as is” and “as available” basis. When you use our application, you are doing so at your own risk. We explicitly state that we are not making any promises or guarantees, whether they are express, implied, or even required by law. These include assurances about the quality of the service, its suitability for your specific needs, or whether it infringes on anyone else's rights. Please keep in mind that any advice or information you receive from us or through our service does not create any warranties beyond what we have explicitly stated here.<br><br>Additionally, while we strive to provide accurate and reliable content, we cannot guarantee that it is always going to be the case. We do not guarantee that the service will always meet your requirements or be available when you need it. There might be interruptions, or it might not function correctly due to factors beyond our control. While we do our best to keep everything running smoothly, we cannot ensure that the service will be free of harmful elements like viruses. If you choose to download any content from our service, you are assuming the risk, and we are not responsible for any damage it might cause to your devices or data.<br><br>We do not endorse or guarantee any products or services advertised through our service or any links we provide. We are not involved in any transactions between you and third-party providers, so any interactions or agreements you make with them are solely your responsibility.<br><br>Our service might not always be accessible or may not work correctly with your device, or operating system. While we strive to provide a seamless experience, we cannot guarantee it in every situation. As such, we want to clarify that we cannot be held responsible for any perceived or actual damages that result from issues related to the content, operation, or use of our service.<br><br>While we may have certain exclusions and limitations in our agreement, these may not apply to you depending on the laws of your jurisdiction. Federal law, as well as laws in some states and other jurisdictions, may offer protections that supersede our disclaimers and exclusions. This means that you may have specific legal rights that are not affected by our agreement. It is essential to understand your rights, as they may vary from state to state or country to country. We want to emphasize that any disclaimers or exclusions in our agreement will only be enforced to the extent permitted by applicable law.<br>Limitation of liability<br>To the maximum extent permitted by applicable law, in no event shall we, along with our subsidiaries, affiliates, officers, directors, agents, partners, suppliers, or employees, be liable for:<br>any indirect, punitive, incidental, special, consequential, or exemplary damages arising from or related to your use of, or inability to use, the service. This includes damages for loss of profits, goodwill, use, data, or other intangible losses;<br>any damage, loss, or injury resulting from hacking, tampering, or unauthorized access to your account or the information within it;<br>errors, mistakes, or inaccuracies in the content provided;<br>personal injury or property damage resulting from your use of the service;<br>unauthorized access to our secure servers or personal information stored therein;<br>interruption or cessation of transmission to or from the service;<br>bugs, viruses, trojan horses, or similar harmful elements transmitted through the service;<br>errors or omissions in any content posted, transmitted, or made available through the service;<br>defamatory, offensive, or illegal conduct of any user or third party. Our liability is limited to the amount you have paid us in the preceding 12 months, or the duration of your agreement with us, whichever is shorter. <br>This limitation of liability section will apply to the fullest extent permitted by law in the applicable jurisdiction whether the alleged liability is based on contract, tort, negligence, strict liability, or any other basis, even if you have been advised of the possibility of such damage.<br><br>Please note that in some jurisdictions, the exclusion or limitation of incidental or consequential damages may not be allowed. This means that these limitations or exclusions might not apply to you. You have specific legal rights, which may vary depending on your jurisdiction. The disclaimers, exclusions, and limitations of liability outlined here may not apply to the extent prohibited by applicable law.<br>Indemnification<br>By using and accessing the service, you agree to defend, indemnify, and hold us, our subsidiaries, affiliates, officers, directors, agents, co-branders, partners, suppliers, and employees harmless from any claims, damages, losses, liabilities, costs, or expenses, including legal fees, arising from:<br>your use of the service, including any data or content you transmit or receive;<br>your violation of these terms, including any breach of representations and warranties;<br>your violation of third-party rights, such as privacy or intellectual property rights;<br>your violation of statutory laws, rules, or regulations;<br>any content submitted from your account, including third-party access using username, password, or other security measures, including misleading, false, or inaccurate information;<br>your intentional misconduct; or<br>any statutory provision by you or your affiliates, officers, directors, agents, co-branders, partners, suppliers, and employees to the extent permitted by law.<br><br>COMMON PROVISIONS<br>No waiver<br>Our failure to assert any right or provision under these terms does not waive that right or provision. No waiver will constitute a continuing waiver of such term or any other term.<br>Service interruption<br>To maintain the best service level, we reserve the right to interrupt the service for maintenance, updates, or other changes, with appropriate or even no notification.<br><br>We may suspend or discontinue the service within legal limits.<br><br>The service may be unavailable due to events beyond our reasonable control, such as infrastructure breakdowns or blackouts.<br>Service reselling<br>You may not reproduce, duplicate, copy, sell, or exploit any part of our application without our express written permission, granted either directly or through a legitimate reselling programme.<br>Privacy policy<br>For information on the use of personal data, you can refer to our application's privacy policy.<br>Intellectual property rights<br>Without prejudice to any more specific provisions in these terms, all intellectual property rights associated with our application, including copyrights, trademark rights, patent rights, and design rights, are exclusively owned by us or our licensors. These rights are protected by applicable laws and international treaties concerning intellectual property.<br><br>All trademarks, whether nominal or figurative, and any other marks, trade names, service marks, word marks, illustrations, images, or logos associated with our application, are and remain the exclusive property of us or our licensors. These are also protected by applicable laws and international treaties related to intellectual property.<br>Changes to the terms<br>We reserve the right to modify these terms at any time, informing you of any changes. <br><br>Such changes will only affect the relationship with you from the date communicated onwards. <br><br>Your continued use of the service will signify your acceptance of the revised terms. If you do not wish to be bound by the changes, you must stop using the service and terminate the agreement.<br><br>If legally required, we will notify you in advance of when the modified terms will take effect.<br>Assignment of contract<br>We reserve the right to transfer, assign, dispose of by novation, or subcontract any or all rights or obligations under these terms, considering your legitimate interests. Provisions about changes to these terms will apply accordingly.<br><br>You cannot assign or transfer your rights or obligations under these terms without our written permission.<br>Contact<br>All communications regarding the use of our application must be sent using the contact information provided in this document.<br>Severability<br>Invalidity or unenforceability of any provision under applicable law will not affect the validity of other provisions, which will remain in full force and effect.<br>US users<br>Any invalid or unenforceable provision will be interpreted to the extent reasonably required to render it valid, enforceable, and consistent with its original intent. This document constitutes the entire agreement between you and us and supersede all other communications, including but not limited to prior agreements concerning such subject matter, to the fullest extent permitted by law.<br>EU users<br>If any provision of this document is void, invalid, or unenforceable, we both agree to do our best to find, in an amicable way, an agreement on valid and enforceable provisions. <br>In case of failure to do so, the void, invalid, or unenforceable provisions will be replaced by the applicable statutory provisions.<br><br>Regardless of the above, the nullity, invalidity, or impossibility of enforcing a particular provision of this document will not nullify the entire agreement, unless the severed provisions are essential for it, or of such importance that we both would not have entered into the contract if we had known that the provision would not be valid, or in cases where the remaining provisions would translate into an unacceptable hardship for you or us.<br>Governing law<br>These terms are governed by the law of the place where we are based, as outlined in the relevant section of this document, without regard to conflict of laws principles.<br>Prevalence of national law<br>However, regardless of the above, if the law of the country that you are based on provides for higher applicable consumer protection standards, such higher standards will prevail.<br>Venue of jurisdiction<br>The jurisdiction over any controversy related to these terms lies with the courts of the place where we are based, as outlined in the relevant section of this document.<br>Exception for consumers in Europe<br>However, regardless of the above, this does not apply if you qualify as a European consumer or if you are a consumer based in the United Kingdom, Switzerland, Norway, or Iceland.<br>UK consumers<br>If you are a consumer based in England and Wales, you may bring legal proceedings related to these terms in the English and Welsh courts. If you are a consumer based in Scotland, you may bring legal proceedings in either the Scottish or the English courts. If you are a consumer based in Northern Ireland, you may bring legal proceedings in either the Northern Irish or the English courts.<br>US users<br>We both agree to waive any right to trial by jury in any court in connection with any action or litigation. Any claims under these terms shall proceed individually and we both agree not to join in a class action or other proceeding with or on behalf of others.<br>Surviving provisions<br>Our agreement will continue in effect until it is terminated by either our application or you. Upon termination, the provisions contained in this document that by their context are intended to survive termination or expiration will survive, including but not limited to the following:<br>your grant of licenses under this document will survive indefinitely;<br>your indemnification obligations will survive indefinitely;<br>the disclaimer of warranties and representations, and the stipulations under the section containing indemnity and limitation of liability provisions, will survive indefinitely.","linux_requirements":{"minimum":"<strong>Minimum:</strong><br><ul class=\"bb_ul\"></ul>","recommended":"<strong>Recommended:</strong><br><ul class=\"bb_ul\"></ul>"},"mac_requirements":{"minimum":"<strong>Minimum:</strong><br><ul class=\"bb_ul\"></ul>","recommended":"<strong>Recommended:</strong><br><ul class=\"bb_ul\"></ul>"},"name":"Two-Timin' Towers Demo","package_groups":[],"pc_requirements":{"minimum":"<strong>Minimum:</strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system</li></ul>","recommended":"<strong>Recommended:</strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system</li></ul>"},"platforms":{"linux":true,"mac":true,"windows":true},"publishers":["TinkerTinker Games"],"ratings":{"dejus":{"descriptors":"Violência fantasiosa","rating":"l"},"steam_germany":{"banned":"0","descriptors":"Derbe Sprache\nFantasy-Gewalt","rating":"12","rating_generated":"1","required_age":"12","use_age_gate":"0"}},"release_date":{"coming_soon":false,"date":"23 Jul, 2024"},"required_age":0,"screenshots":[{"id":0,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/ss_0010823dc989cd44862db1dbe61bb7472c64817b.1920x1080.jpg?t=1723304389","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/ss_0010823dc989cd44862db1dbe61bb7472c64817b.600x338.jpg?t=1723304389"},{"id":1,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/ss_5ebf14b710fcf23bb6272b309f4e5309c0798cbc.1920x1080.jpg?t=1723304389","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/ss_5ebf14b710fcf23bb6272b309f4e5309c0798cbc.600x338.jpg?t=1723304389"},{"id":2,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/ss_89a5b0ae4bcd571e5803dca4d842ba1b2c95b270.1920x1080.jpg?t=1723304389","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/ss_89a5b0ae4bcd571e5803dca4d842ba1b2c95b270.600x338.jpg?t=1723304389"},{"id":3,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/ss_93b81e334a5a86ce20d2fca74369f22ce1e66c2d.1920x1080.jpg?t=1723304389","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3113410/ss_93b81e334a5a86ce20d2fca74369f22ce1e66c2d.600x338.jpg?t=1723304389"}],"short_description":"Two-Timin’ Towers is a tower defense game where your towers have friendly fire. Turning a classic strategy game into an out-of-control bullet hell adventure. Navigate high-intensity battlefields as you build towers, dodge bullets, defeat enemies, loot currency, and most importantly… try to survive.","steam_appid":3113410,"support_info":{"email":"twotimintowers@gmail.com","url":""},"supported_languages":"English<strong>*</strong><br><strong>*</strong>languages with full audio support","type":"demo","website":null}