{"about_the_game":"<p class=\"bb_paragraph\"><strong>KNOCKOFF</strong> is a first of its kind RPG that takes heavy influence from traditional 2D Fighting Games. Featuring fast paced dynamic combat, the PvP mode leaves you wanting more. With free outfits unlocked through playing the game and a ranked leaderboard on the way, there's a lot to look forward too with <strong>KNOCKOFF'</strong>s multiplayer demo. </p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/extras/gif.gif?t=1736626392\" /></p><p class=\"bb_paragraph\">While the PVP demo is <u>available <strong><i>NOW</i></strong></u>, <strong>KNOCKOFF</strong> will eventually be released, featuring 15-30 hours of gameplay set in <i>THE MALL</i> Our protagonist <strong>Amy</strong> will embark on a quest to thwart the villainous <strong>Camilla Carmilla</strong> and her <strong>Goth Baddies</strong>, and along the way release a few lost souls in the process. While the full game is a ways away,  You can play our <strong><i>FREE Demo</i></strong>, that will include the entire first chapter of <strong>KNOCKOFF</strong>, which will be released by summer 2026. We will <strong>NOT</strong> be releasing <strong>KNOCKOFF</strong> into early access, all pre release content will be available for free through the demo system, and we will not charge a cent until <strong>KNOCKOFF</strong> is complete. </p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/extras/beem.png?t=1736626392\" /></p><p class=\"bb_paragraph\"><strong><i>The Gangs</i></strong></p><p class=\"bb_paragraph\"><strong>The Mall</strong> features 6 gangs, each with a particular culture and dress code. Set within an infinite mall, <strong>KNOCKOFF</strong> features a variety of environments and characters, all with interesting stories to tell.</p><p class=\"bb_paragraph\"><strong>The Mall</strong> is infested with <strong>Sprites</strong> which possess almost every object. However, not all sprites are created equally; Some possess mundane everyday objects, while others hold <strong>Humanoid Possession</strong> but the most sought after possessions are <strong>Possessed Weapons</strong>. While the first two are able to talk to just about anybody, <strong>Possessed Weapons</strong> are only able to talk to there hosts, making it one of the most intimate relationships, especially if you don't get along. These powerful objects empower the many leaders of the gangs in <strong>KNOCKOFF</strong>. The fact of the matter is that death is not only an ever present facet of the world of <strong>KNOCKOFF</strong>, but also an impermanent affair. The reality of the situation is that you probably don't want to be throwing the word &quot;<strong>Ghoul</strong>&quot; around in the hallways of <strong>The Mall</strong></p><p class=\"bb_paragraph\"><strong>Sprites</strong> aren't the only thing you'll find around here, they call them gangs for a reason after all. The riff raff are called <strong>Goobers</strong>, and they are a mixed bunch. The bosses love favoritism, and not all goobers are created equal. Some of these folks may have 3 or more moves, a few have 2, and some of them cant even block, and believe me, they hold on tight to that one trick pony. But be warned tho, some of those <strong>Goobers</strong> are smarter then the others. You might walk into one room and find a bunch of flower pickers, then the next, they might be sharp as a tack, coordinating there moves like a well oiled machine. Don't worry tho, I'm sure you'll handle it. </p><p class=\"bb_paragraph\">Above the <strong>Goobers</strong> are <strong>Super Goobers</strong>. powerful enemies with only the best equipment. A formidable fight, they pack a mean punch, and they are never alone. Its a mixed bag, but these captains tend to keep the best around them, so come prepared. On the plus side, they are pretty easy to knock around, so make sure they don't gang up on you, and you'll do great. </p><p class=\"bb_paragraph\">The gangs aren't the only thing you'll find in the mall though, some crazy sub cultures might be out there, and I even hear there's a group who think they come from another planet and speak a crazy language. Not only that, there's secrets under every rock, just waiting for some wacko to put all the puzzle pieces together. </p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/extras/Blue.png?t=1736626392\" /></p><p class=\"bb_paragraph\"><strong>The Goths</strong></p><p class=\"bb_paragraph\">Headed by the mysterious <strong>Camilla Carmilla</strong>, <strong>The Goths</strong> are one of the most powerful and enigmatic gang in <strong>KNOCKOFF</strong>. Controlling a vast swath of land deep within the belly of <strong>The Mall,</strong> They are here to carve up <strong>The Mall</strong> for there own purposes. Rumor has it that <strong>Camilla</strong> is suffering intense grief at the loss of her spouse and is on a quest to find her sprite, and collect The <strong>McGuffins</strong> from the 6 gangs to produce some kind of machine to return her to her original body, alive. This which queen has a mean right hook and doesn't care where it ends up. They say that <strong>The Goths</strong> have torn the very fabric of the mall, opening fiery pits around there fearsome lair. </p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/extras/Camilla.png?t=1736626392\" /></p><p class=\"bb_paragraph\"><strong>The Punks</strong></p><p class=\"bb_paragraph\"><strong>The Punks</strong> take great offense at the title &quot;gang,&quot; they prefer to think of themselves as a big family, and spend a lot more time sleeping then they do fighting. Located across the great rope bridge, <strong>The Punks</strong> have made a cozy home for themselves in &quot;<strong>The Junkyard</strong>.&quot; Comprised mostly of rejects and free spirits from the other gangs, <strong>The Junkyard</strong> is home to more then just layabouts. Hundreds of <strong>Sprites</strong> litter the landscape, with many of them having stories to tell of there homes and the good old days. An average member, who always attends her meetings, Amy is a former member of the <strong>Emo</strong> gang and brother of there leader <strong>Blue</strong>. A bleeding heart, <strong>Amy</strong> spends most of her days having tea parties with ghosts and helping them find the <strong>Catboy Sprite Patrol</strong> to get them <strong>Humanoid Possessions</strong>, <strong>Amy</strong> has a good heart, but doesn't know the meaning of the word no.</p><p class=\"bb_paragraph\">All that changed when on a beautiful Tuesday when <strong>Amy's</strong> prized <strong>Bass</strong> is possessed by not one, but two <strong>Sprites</strong> at the same time. Shocked <strong>Amy</strong> rushes to tell her friend <strong>Horatio</strong>, who instead of using the <strong>McGuffin's</strong> magical contrivance to remove the <strong>Sprites</strong>, insists that now that she has a possessed weapon she must learn to wield it and challenges her to a tutorial. But would you believe it, <strong>Carmilla</strong> busts in, to steal the magical device, swerving into <strong>Horatio</strong> in the process. After a brief scuffle, <strong>Camilla</strong> flees with the <strong>McGuffin</strong> with her, as <strong>Amy</strong> rushes to <strong>Horatio's</strong> side. With the magical <strong>Contrivance</strong> powers of it out of the picture <strong>Amy</strong> comforts <strong>Horatio</strong> as he curses the whole affair. <strong>Amy</strong> now stirred from the events, swears to put a stop to her before she hurts somebody, and definitely not to ask the neighbors if she can borrow a <strong>McGuffin</strong>, that is if <strong>Camilla</strong> doesn't get to them first. </p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/extras/Crasgh.jpg?t=1736626392\" /></p><p class=\"bb_paragraph\"><strong>The Emo's</strong></p><p class=\"bb_paragraph\">Located just across the bridge, the <strong>Emo's</strong> are a violent gang of thugs, who even run protection rackets on the bridge itself, Locked in a vicious gang war with the <strong>Catboy's</strong>, these mall ninjas mean business. Armed tooth and nail, the <strong>Emo's</strong> hold an iron grip over there territory from there security cameras, A land of broken glass, the <strong>Emo's</strong> are a mean bunch, but <strong>Amy</strong> knows all about it. <strong>Blue</strong> is a real character, with mommy issues on account of his possession of his moms sprite, in his own guitar no less. A brooding mamas boy, <strong>Blue</strong> spends most of his days sulking, skatin', and trying to impress girls. Although the turf war with The <strong>Catboy's</strong> would probably be going his way if he ever bothered to participate. <strong>Blue</strong> lives in a totally chill skate park, is currently single and definitely didn't pay me to say that. </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\">Th3 <strong>C4tb0y5</strong>!!!!!!!!!!!</p><p class=\"bb_paragraph\">the <strong>catboys</strong> aw the most powewfuw gang in the wowwd!!!!!!!! I wiw destwoy u puny hooman We aw the best boys that thew evew was, <strong>Daddy</strong> towd me!!!!!! We aw vewy mighty n I have the most powewfuw wobots of aw the kitties!!!!!!!!!!! <strong>Daddy</strong> is a big stwong wobot and he couwd kick youw but!!!!!!!!! did u no that my Awmy of Catbots wiww destwoy you and I wiww witewawwy destwoy u.  we will bweak u into a miwwion pieces if u twy to come to our tewitowy, we aw wiwwy stwong and we have a wot of sowdiews!!!!! You wiww bow to my powew as my contwaptions bwing u 2 heel!!!!!!! Fowish Hooman I wiww destwoy you!!!!!!! </p><p class=\"bb_paragraph\">Sorry about that, now that I'm back let me tell you about this tin pot dictator Yarnhead. All male and geneticaly engineered for warfare,(allegedly)  the <strong>Catboy's</strong> are a group of megalomeniacel hairballs. If youve met one Catboy, youve met them all. They tell you they will &quot;destwoy u,&quot; attempt to scratch your eye out, and talk about this game wawship simuwatow.(The most accuwate navaw simuwatow of aw time) There leader <strong>Yarnhead</strong> is the worst of the bunch. He was able to use the contrivance of the <strong>McGuffin</strong> to put his boyfriend into a giantmech that he drive around everywhere, throwing <strong>Catbots</strong> every which way as he goes. Born from plastic balls from a giant gumball machine, they where born yesterday and dont ask questions. If they could stop tripping over there own feat they would have defeated the <strong>Emo's</strong> by now, but luckily that's not stopping anytime soon. A warlike people, they fight among themselves just as much as they fight everyone else, and they even say that the <strong>Catboys</strong> eat nothing but sushi. You know they believe that they are actually in the navy and according to them, in the navy you eat sushi and cuddle and save the boats from the hoomans. Don't let the speech impediment fool you though, these semen and marines are some tough cookies, even if they sleep 4 to a bed, just like in the navy. </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\"><strong>The</strong> <strong>Mannequins</strong></p><p class=\"bb_paragraph\"><strong>The Malls</strong> best kept secret, the <strong>Mannequins</strong> control by far the largest territory in the mall. Most of them are busy with the debauchery of there endless parties, but a few tortured souls refuse to rest acting as defenders of <strong>Downstairs</strong>. You'll find no <strong>Goobers</strong> here, the <strong>Mannequins</strong> are a tough bunch, and you better watch your step, they don't like bleeders down there. Controlling the vast labyrinth of the furniture store/meatballrama, there's a plenty of stories to go around, but good luck getting the furniture to pay attention to your conversation. That being said, once you say hello to these &quot;tough guys&quot; they spill there entire life story. Once you finish getting your ear bitten off, you might want to meet the locals, The mean streets of the meatballrporium are home to many, but none are more notorious then <strong>Carson</strong>. Would you believe this guys luck? This guy dies and he just so happens to possess the only known car in the entire mall!?! I can only imagine the stares he must get as he goes on his joyrides.</p><p class=\"bb_paragraph\"><strong>Carson</strong> might run <strong>Downstairs</strong>, but <strong>Amy's</strong> most recent &quot;pet project&quot; might just take his place. Would you believe <strong>Amy's</strong> luck? Not only does she lose her bass, her favorite plushy just so happened to get possessed the same exact day, and she has the nerve to complain that she's possessing a male doll?! Needless to say, Amy took Emily on an express ticket to <strong>Catboy</strong> turf to get her settled with a proper mannequin. She might not have a possessed weapon, but her body is a deadly weapon,  and she knows how to use it. A fashionista, Emily never wears the same thing twice and changes her outfit with each strike. People are wondering what she did before she died, but she always seems to get interrupted right before she gets to share. That being said, who knows what might happen when <strong>Camilla</strong> comes for the <strong>McGuffin</strong>. Things could get ugly, but if there's one thing that I know, its that <strong>Mannequins</strong> respect the strong, and don't like intruders. </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\"><strong>The</strong> <strong>Ravers</strong></p><p class=\"bb_paragraph\"><strong>The</strong> <strong>Ravers</strong> live for one thing and one thing only, <strong>The Rave</strong>. Spend some time in the rooftop parties of <strong>The Rave</strong> and you'll notice that they do things very similarly to <strong>The Punks</strong>, with 1 big exception, they follow whoever parties the hardest. A swirling haze of glow sticks and Kandi, the party never stops here and that's just the way they like it. with a front seat view of the known universe, and mountains of <strong>Catboy</strong> tech, their beacons shine across the inky blankness of <strong>The Mall</strong>.</p><p class=\"bb_paragraph\">But of course, you can't talk about <strong>The Rave</strong>, without talking about there fearless hosts. People say a lot of things of the notorious tag team, <strong>Sparkle and Glow,</strong> but for those of us who say bad things about them, they usually have something to say about that, and they always fight out. It's said that they partied for 7 consecutive days to usurp the previous host, and they are never ones to be outdone. If you seek an audience with them, you will have to party like your life depends on it, because it just might. </p><p class=\"bb_paragraph\">The couple are never seen apart, and <strong>Sparkle</strong> takes the phrase &quot;seen and not heard&quot; a little too far. She may be mute, but she makes her voice heard with her brawn. She's as strong as an ox, and as big as one too, and you'll find it just as hard to move her, with her <strong>Kandi</strong> armor and hammer. <strong>Sparkle and Glow</strong> stick with each other through thick and thin, and <strong>Glow</strong> has thin in spade. <strong>Sparkle</strong> may not have much to say, but once <strong>Glow</strong> starts talking she never stops. You may think that she calls the shot, but they say that <strong>Sparkle</strong> is the one whos really in charge, though the leash may be deceiving. This question aside, they form a powerful unified front and never shy away from a challenge. </p><p class=\"bb_paragraph\">Unlike other gangs, <strong>The Ravers</strong> don't struggle with the same neighborly disputes, The only way to reach there loft is through the only elevator, and they control the power to the whole mall. Through there close relationship with the <strong>Catboy's</strong> and with the elevator in there territory, <strong>The Ravers</strong> don't deal with many headaches. That being said, geography has never stopped <strong>Camilla</strong> before, and it could get ugly up there. </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\"><strong>What's</strong> Next?</p><p class=\"bb_paragraph\">With this and more on the way, there's a lot to love with <strong>KNOCKOFF</strong>. For right now you'll have to make due with the PVP demo, but rest assured, <strong>Camilla</strong>, <strong>Blue</strong> <strong>Amy</strong> and <strong>Yarnhead</strong>, will be free forever, with the story demo following close behind. It may be a while before the story demo is finished, but don't worry, we will maintain a steady stream of content, as its produced. From animations, to story mode levels and eventually a new game mode where you fight waves of goobers.</p><p class=\"bb_paragraph\">The story demo may only be a condensed version of the final game, but that doesn't mean that it isn't stuffed with content. Taking place within the <strong>Emo's</strong> verses <strong>Catboy's</strong> chapter, The demo will take Amy and friends across the mall, from the <strong>Junkyard</strong>, across the rope bridge, you will be captured by the <strong>Emo's</strong> and whisked through the <strong>DMZ</strong> to the first of 6 mall <strong>Hallways</strong>, Each containing of a personalized store featuring not just side quests, but also break rooms and warehouses, where the gangs spend there time. Not to mention 3 personalized boss fights for the 3 bosses of the chapter, each tailor made to the play styles of each boss. Not only this, but upon defeating each boss, you unlock them for the rest of the campaign, with exactly the same move set as the boss fight! Not only this but rumor has it that there may be a community of <strong>Mannequins</strong> sneaking around in the dark corners of the mall. </p><p class=\"bb_paragraph\">The demo will not only include 3 primary endings, but will also consist of hundreds of sub endings, depending on Amy's choices throughout the demo. With mysteries to solve, <strong>KNOCKOFF</strong> is a story about coming to terms with the loss of a loved one, and through your guidance, the citizens of The Mall just might learn a thing or too. Here at Terra Heavy Industries we cant wait to introduce you to the world of <strong>KNOCKOFF</strong>. </p><p class=\"bb_paragraph\"></p>","background":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/page_bg_generated_v6b.jpg?t=1736626392","background_raw":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/page.bg.jpg?t=1736626392","capsule_image":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/b527a87e6c4c17c86239a182daa3546073cac37f/capsule_231x87.jpg?t=1736626392","capsule_imagev5":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/b527a87e6c4c17c86239a182daa3546073cac37f/capsule_184x69.jpg?t=1736626392","categories":[{"description":"Single-player","id":2},{"description":"Multi-player","id":1},{"description":"PvP","id":49},{"description":"Online PvP","id":36},{"description":"Shared/Split Screen PvP","id":37},{"description":"Shared/Split Screen","id":24},{"description":"Partial Controller Support","id":18},{"description":"Remote Play Together","id":44}],"content_descriptors":{"ids":[],"notes":null},"demos":[{"appid":3416990,"description":""}],"detailed_description":"<p class=\"bb_paragraph\"><strong>KNOCKOFF</strong> is a first of its kind RPG that takes heavy influence from traditional 2D Fighting Games. Featuring fast paced dynamic combat, the PvP mode leaves you wanting more. With free outfits unlocked through playing the game and a ranked leaderboard on the way, there's a lot to look forward too with <strong>KNOCKOFF'</strong>s multiplayer demo. </p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/extras/gif.gif?t=1736626392\" /></p><p class=\"bb_paragraph\">While the PVP demo is <u>available <strong><i>NOW</i></strong></u>, <strong>KNOCKOFF</strong> will eventually be released, featuring 15-30 hours of gameplay set in <i>THE MALL</i> Our protagonist <strong>Amy</strong> will embark on a quest to thwart the villainous <strong>Camilla Carmilla</strong> and her <strong>Goth Baddies</strong>, and along the way release a few lost souls in the process. While the full game is a ways away,  You can play our <strong><i>FREE Demo</i></strong>, that will include the entire first chapter of <strong>KNOCKOFF</strong>, which will be released by summer 2026. We will <strong>NOT</strong> be releasing <strong>KNOCKOFF</strong> into early access, all pre release content will be available for free through the demo system, and we will not charge a cent until <strong>KNOCKOFF</strong> is complete. </p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/extras/beem.png?t=1736626392\" /></p><p class=\"bb_paragraph\"><strong><i>The Gangs</i></strong></p><p class=\"bb_paragraph\"><strong>The Mall</strong> features 6 gangs, each with a particular culture and dress code. Set within an infinite mall, <strong>KNOCKOFF</strong> features a variety of environments and characters, all with interesting stories to tell.</p><p class=\"bb_paragraph\"><strong>The Mall</strong> is infested with <strong>Sprites</strong> which possess almost every object. However, not all sprites are created equally; Some possess mundane everyday objects, while others hold <strong>Humanoid Possession</strong> but the most sought after possessions are <strong>Possessed Weapons</strong>. While the first two are able to talk to just about anybody, <strong>Possessed Weapons</strong> are only able to talk to there hosts, making it one of the most intimate relationships, especially if you don't get along. These powerful objects empower the many leaders of the gangs in <strong>KNOCKOFF</strong>. The fact of the matter is that death is not only an ever present facet of the world of <strong>KNOCKOFF</strong>, but also an impermanent affair. The reality of the situation is that you probably don't want to be throwing the word &quot;<strong>Ghoul</strong>&quot; around in the hallways of <strong>The Mall</strong></p><p class=\"bb_paragraph\"><strong>Sprites</strong> aren't the only thing you'll find around here, they call them gangs for a reason after all. The riff raff are called <strong>Goobers</strong>, and they are a mixed bunch. The bosses love favoritism, and not all goobers are created equal. Some of these folks may have 3 or more moves, a few have 2, and some of them cant even block, and believe me, they hold on tight to that one trick pony. But be warned tho, some of those <strong>Goobers</strong> are smarter then the others. You might walk into one room and find a bunch of flower pickers, then the next, they might be sharp as a tack, coordinating there moves like a well oiled machine. Don't worry tho, I'm sure you'll handle it. </p><p class=\"bb_paragraph\">Above the <strong>Goobers</strong> are <strong>Super Goobers</strong>. powerful enemies with only the best equipment. A formidable fight, they pack a mean punch, and they are never alone. Its a mixed bag, but these captains tend to keep the best around them, so come prepared. On the plus side, they are pretty easy to knock around, so make sure they don't gang up on you, and you'll do great. </p><p class=\"bb_paragraph\">The gangs aren't the only thing you'll find in the mall though, some crazy sub cultures might be out there, and I even hear there's a group who think they come from another planet and speak a crazy language. Not only that, there's secrets under every rock, just waiting for some wacko to put all the puzzle pieces together. </p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/extras/Blue.png?t=1736626392\" /></p><p class=\"bb_paragraph\"><strong>The Goths</strong></p><p class=\"bb_paragraph\">Headed by the mysterious <strong>Camilla Carmilla</strong>, <strong>The Goths</strong> are one of the most powerful and enigmatic gang in <strong>KNOCKOFF</strong>. Controlling a vast swath of land deep within the belly of <strong>The Mall,</strong> They are here to carve up <strong>The Mall</strong> for there own purposes. Rumor has it that <strong>Camilla</strong> is suffering intense grief at the loss of her spouse and is on a quest to find her sprite, and collect The <strong>McGuffins</strong> from the 6 gangs to produce some kind of machine to return her to her original body, alive. This which queen has a mean right hook and doesn't care where it ends up. They say that <strong>The Goths</strong> have torn the very fabric of the mall, opening fiery pits around there fearsome lair. </p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/extras/Camilla.png?t=1736626392\" /></p><p class=\"bb_paragraph\"><strong>The Punks</strong></p><p class=\"bb_paragraph\"><strong>The Punks</strong> take great offense at the title &quot;gang,&quot; they prefer to think of themselves as a big family, and spend a lot more time sleeping then they do fighting. Located across the great rope bridge, <strong>The Punks</strong> have made a cozy home for themselves in &quot;<strong>The Junkyard</strong>.&quot; Comprised mostly of rejects and free spirits from the other gangs, <strong>The Junkyard</strong> is home to more then just layabouts. Hundreds of <strong>Sprites</strong> litter the landscape, with many of them having stories to tell of there homes and the good old days. An average member, who always attends her meetings, Amy is a former member of the <strong>Emo</strong> gang and brother of there leader <strong>Blue</strong>. A bleeding heart, <strong>Amy</strong> spends most of her days having tea parties with ghosts and helping them find the <strong>Catboy Sprite Patrol</strong> to get them <strong>Humanoid Possessions</strong>, <strong>Amy</strong> has a good heart, but doesn't know the meaning of the word no.</p><p class=\"bb_paragraph\">All that changed when on a beautiful Tuesday when <strong>Amy's</strong> prized <strong>Bass</strong> is possessed by not one, but two <strong>Sprites</strong> at the same time. Shocked <strong>Amy</strong> rushes to tell her friend <strong>Horatio</strong>, who instead of using the <strong>McGuffin's</strong> magical contrivance to remove the <strong>Sprites</strong>, insists that now that she has a possessed weapon she must learn to wield it and challenges her to a tutorial. But would you believe it, <strong>Carmilla</strong> busts in, to steal the magical device, swerving into <strong>Horatio</strong> in the process. After a brief scuffle, <strong>Camilla</strong> flees with the <strong>McGuffin</strong> with her, as <strong>Amy</strong> rushes to <strong>Horatio's</strong> side. With the magical <strong>Contrivance</strong> powers of it out of the picture <strong>Amy</strong> comforts <strong>Horatio</strong> as he curses the whole affair. <strong>Amy</strong> now stirred from the events, swears to put a stop to her before she hurts somebody, and definitely not to ask the neighbors if she can borrow a <strong>McGuffin</strong>, that is if <strong>Camilla</strong> doesn't get to them first. </p><p class=\"bb_paragraph\"><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/extras/Crasgh.jpg?t=1736626392\" /></p><p class=\"bb_paragraph\"><strong>The Emo's</strong></p><p class=\"bb_paragraph\">Located just across the bridge, the <strong>Emo's</strong> are a violent gang of thugs, who even run protection rackets on the bridge itself, Locked in a vicious gang war with the <strong>Catboy's</strong>, these mall ninjas mean business. Armed tooth and nail, the <strong>Emo's</strong> hold an iron grip over there territory from there security cameras, A land of broken glass, the <strong>Emo's</strong> are a mean bunch, but <strong>Amy</strong> knows all about it. <strong>Blue</strong> is a real character, with mommy issues on account of his possession of his moms sprite, in his own guitar no less. A brooding mamas boy, <strong>Blue</strong> spends most of his days sulking, skatin', and trying to impress girls. Although the turf war with The <strong>Catboy's</strong> would probably be going his way if he ever bothered to participate. <strong>Blue</strong> lives in a totally chill skate park, is currently single and definitely didn't pay me to say that. </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\">Th3 <strong>C4tb0y5</strong>!!!!!!!!!!!</p><p class=\"bb_paragraph\">the <strong>catboys</strong> aw the most powewfuw gang in the wowwd!!!!!!!! I wiw destwoy u puny hooman We aw the best boys that thew evew was, <strong>Daddy</strong> towd me!!!!!! We aw vewy mighty n I have the most powewfuw wobots of aw the kitties!!!!!!!!!!! <strong>Daddy</strong> is a big stwong wobot and he couwd kick youw but!!!!!!!!! did u no that my Awmy of Catbots wiww destwoy you and I wiww witewawwy destwoy u.  we will bweak u into a miwwion pieces if u twy to come to our tewitowy, we aw wiwwy stwong and we have a wot of sowdiews!!!!! You wiww bow to my powew as my contwaptions bwing u 2 heel!!!!!!! Fowish Hooman I wiww destwoy you!!!!!!! </p><p class=\"bb_paragraph\">Sorry about that, now that I'm back let me tell you about this tin pot dictator Yarnhead. All male and geneticaly engineered for warfare,(allegedly)  the <strong>Catboy's</strong> are a group of megalomeniacel hairballs. If youve met one Catboy, youve met them all. They tell you they will &quot;destwoy u,&quot; attempt to scratch your eye out, and talk about this game wawship simuwatow.(The most accuwate navaw simuwatow of aw time) There leader <strong>Yarnhead</strong> is the worst of the bunch. He was able to use the contrivance of the <strong>McGuffin</strong> to put his boyfriend into a giantmech that he drive around everywhere, throwing <strong>Catbots</strong> every which way as he goes. Born from plastic balls from a giant gumball machine, they where born yesterday and dont ask questions. If they could stop tripping over there own feat they would have defeated the <strong>Emo's</strong> by now, but luckily that's not stopping anytime soon. A warlike people, they fight among themselves just as much as they fight everyone else, and they even say that the <strong>Catboys</strong> eat nothing but sushi. You know they believe that they are actually in the navy and according to them, in the navy you eat sushi and cuddle and save the boats from the hoomans. Don't let the speech impediment fool you though, these semen and marines are some tough cookies, even if they sleep 4 to a bed, just like in the navy. </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\"><strong>The</strong> <strong>Mannequins</strong></p><p class=\"bb_paragraph\"><strong>The Malls</strong> best kept secret, the <strong>Mannequins</strong> control by far the largest territory in the mall. Most of them are busy with the debauchery of there endless parties, but a few tortured souls refuse to rest acting as defenders of <strong>Downstairs</strong>. You'll find no <strong>Goobers</strong> here, the <strong>Mannequins</strong> are a tough bunch, and you better watch your step, they don't like bleeders down there. Controlling the vast labyrinth of the furniture store/meatballrama, there's a plenty of stories to go around, but good luck getting the furniture to pay attention to your conversation. That being said, once you say hello to these &quot;tough guys&quot; they spill there entire life story. Once you finish getting your ear bitten off, you might want to meet the locals, The mean streets of the meatballrporium are home to many, but none are more notorious then <strong>Carson</strong>. Would you believe this guys luck? This guy dies and he just so happens to possess the only known car in the entire mall!?! I can only imagine the stares he must get as he goes on his joyrides.</p><p class=\"bb_paragraph\"><strong>Carson</strong> might run <strong>Downstairs</strong>, but <strong>Amy's</strong> most recent &quot;pet project&quot; might just take his place. Would you believe <strong>Amy's</strong> luck? Not only does she lose her bass, her favorite plushy just so happened to get possessed the same exact day, and she has the nerve to complain that she's possessing a male doll?! Needless to say, Amy took Emily on an express ticket to <strong>Catboy</strong> turf to get her settled with a proper mannequin. She might not have a possessed weapon, but her body is a deadly weapon,  and she knows how to use it. A fashionista, Emily never wears the same thing twice and changes her outfit with each strike. People are wondering what she did before she died, but she always seems to get interrupted right before she gets to share. That being said, who knows what might happen when <strong>Camilla</strong> comes for the <strong>McGuffin</strong>. Things could get ugly, but if there's one thing that I know, its that <strong>Mannequins</strong> respect the strong, and don't like intruders. </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\"><strong>The</strong> <strong>Ravers</strong></p><p class=\"bb_paragraph\"><strong>The</strong> <strong>Ravers</strong> live for one thing and one thing only, <strong>The Rave</strong>. Spend some time in the rooftop parties of <strong>The Rave</strong> and you'll notice that they do things very similarly to <strong>The Punks</strong>, with 1 big exception, they follow whoever parties the hardest. A swirling haze of glow sticks and Kandi, the party never stops here and that's just the way they like it. with a front seat view of the known universe, and mountains of <strong>Catboy</strong> tech, their beacons shine across the inky blankness of <strong>The Mall</strong>.</p><p class=\"bb_paragraph\">But of course, you can't talk about <strong>The Rave</strong>, without talking about there fearless hosts. People say a lot of things of the notorious tag team, <strong>Sparkle and Glow,</strong> but for those of us who say bad things about them, they usually have something to say about that, and they always fight out. It's said that they partied for 7 consecutive days to usurp the previous host, and they are never ones to be outdone. If you seek an audience with them, you will have to party like your life depends on it, because it just might. </p><p class=\"bb_paragraph\">The couple are never seen apart, and <strong>Sparkle</strong> takes the phrase &quot;seen and not heard&quot; a little too far. She may be mute, but she makes her voice heard with her brawn. She's as strong as an ox, and as big as one too, and you'll find it just as hard to move her, with her <strong>Kandi</strong> armor and hammer. <strong>Sparkle and Glow</strong> stick with each other through thick and thin, and <strong>Glow</strong> has thin in spade. <strong>Sparkle</strong> may not have much to say, but once <strong>Glow</strong> starts talking she never stops. You may think that she calls the shot, but they say that <strong>Sparkle</strong> is the one whos really in charge, though the leash may be deceiving. This question aside, they form a powerful unified front and never shy away from a challenge. </p><p class=\"bb_paragraph\">Unlike other gangs, <strong>The Ravers</strong> don't struggle with the same neighborly disputes, The only way to reach there loft is through the only elevator, and they control the power to the whole mall. Through there close relationship with the <strong>Catboy's</strong> and with the elevator in there territory, <strong>The Ravers</strong> don't deal with many headaches. That being said, geography has never stopped <strong>Camilla</strong> before, and it could get ugly up there. </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\"><strong>What's</strong> Next?</p><p class=\"bb_paragraph\">With this and more on the way, there's a lot to love with <strong>KNOCKOFF</strong>. For right now you'll have to make due with the PVP demo, but rest assured, <strong>Camilla</strong>, <strong>Blue</strong> <strong>Amy</strong> and <strong>Yarnhead</strong>, will be free forever, with the story demo following close behind. It may be a while before the story demo is finished, but don't worry, we will maintain a steady stream of content, as its produced. From animations, to story mode levels and eventually a new game mode where you fight waves of goobers.</p><p class=\"bb_paragraph\">The story demo may only be a condensed version of the final game, but that doesn't mean that it isn't stuffed with content. Taking place within the <strong>Emo's</strong> verses <strong>Catboy's</strong> chapter, The demo will take Amy and friends across the mall, from the <strong>Junkyard</strong>, across the rope bridge, you will be captured by the <strong>Emo's</strong> and whisked through the <strong>DMZ</strong> to the first of 6 mall <strong>Hallways</strong>, Each containing of a personalized store featuring not just side quests, but also break rooms and warehouses, where the gangs spend there time. Not to mention 3 personalized boss fights for the 3 bosses of the chapter, each tailor made to the play styles of each boss. Not only this, but upon defeating each boss, you unlock them for the rest of the campaign, with exactly the same move set as the boss fight! Not only this but rumor has it that there may be a community of <strong>Mannequins</strong> sneaking around in the dark corners of the mall. </p><p class=\"bb_paragraph\">The demo will not only include 3 primary endings, but will also consist of hundreds of sub endings, depending on Amy's choices throughout the demo. With mysteries to solve, <strong>KNOCKOFF</strong> is a story about coming to terms with the loss of a loved one, and through your guidance, the citizens of The Mall just might learn a thing or too. Here at Terra Heavy Industries we cant wait to introduce you to the world of <strong>KNOCKOFF</strong>. </p><p class=\"bb_paragraph\"></p>","developers":["TERRA HEAVY INDUSTRIES"],"genres":[{"description":"Action","id":"1"},{"description":"Adventure","id":"25"},{"description":"Indie","id":"23"},{"description":"RPG","id":"3"}],"header_image":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/header.jpg?t=1736626392","is_free":false,"linux_requirements":[],"mac_requirements":{"minimum":"<strong>Minimum:</strong><br><ul class=\"bb_ul\"><li><strong>OS:</strong> OSX Mojave<br></li><li><strong>Processor:</strong> 2.9GHz quad-core Intel Core i7 or Apple M1 Silicon<br></li><li><strong>Memory:</strong> 8 GB RAM<br></li><li><strong>Graphics:</strong> Intel HD Graphics 530<br></li><li><strong>Sound Card:</strong> DAC 96 kHz</li></ul>"},"movies":[{"highlight":true,"id":257083761,"mp4":{"480":"http://video.akamai.steamstatic.com/store_trailers/257083761/movie480.mp4?t=1735253684","max":"http://video.akamai.steamstatic.com/store_trailers/257083761/movie_max.mp4?t=1735253684"},"name":"KO-GAMEPLAY-1","thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/257083761/2114d4632d73a7bfe8afd4748451cf52ac6cb34d/movie_600x337.jpg?t=1735253684","webm":{"480":"http://video.akamai.steamstatic.com/store_trailers/257083761/movie480_vp9.webm?t=1735253684","max":"http://video.akamai.steamstatic.com/store_trailers/257083761/movie_max_vp9.webm?t=1735253684"}}],"name":"KNOCKOFF","package_groups":[],"pc_requirements":{"minimum":"<strong>Minimum:</strong><br><ul class=\"bb_ul\"><li><strong>OS *:</strong> Windows 7<br></li><li><strong>Processor:</strong> 2.9GHz quad-core Intel Core i7<br></li><li><strong>Memory:</strong> 8 GB RAM<br></li><li><strong>Graphics:</strong> Intel HD Graphics 530<br></li><li><strong>Sound Card:</strong> DAC 96 kHz</li></ul>"},"platforms":{"linux":false,"mac":true,"windows":true},"publishers":["TERRA HEAVY INDUSTRIES"],"ratings":{"dejus":{"banned":"0","descriptors":"Violência fantasiosa","rating":"l","rating_generated":"1","required_age":"0","use_age_gate":"0"},"steam_germany":{"banned":"0","descriptors":"Fantasy-Gewalt","rating":"6","rating_generated":"1","required_age":"6","use_age_gate":"0"}},"release_date":{"coming_soon":true,"date":"Coming soon"},"required_age":0,"screenshots":[{"id":0,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/ss_8291826ed9eae95150ac2bcd49137c7affdf4698.1920x1080.jpg?t=1736626392","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/ss_8291826ed9eae95150ac2bcd49137c7affdf4698.600x338.jpg?t=1736626392"},{"id":1,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/ss_0e96604dd1a6a3836a545bb3f73f78b52afb870c.1920x1080.jpg?t=1736626392","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/ss_0e96604dd1a6a3836a545bb3f73f78b52afb870c.600x338.jpg?t=1736626392"},{"id":2,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/ss_cabc9d73fa534938c84bc2eea8ed74370b414e58.1920x1080.jpg?t=1736626392","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/ss_cabc9d73fa534938c84bc2eea8ed74370b414e58.600x338.jpg?t=1736626392"},{"id":3,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/ss_a3db9d4662c3c1d5c3509622e7fa439fb0121675.1920x1080.jpg?t=1736626392","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/ss_a3db9d4662c3c1d5c3509622e7fa439fb0121675.600x338.jpg?t=1736626392"},{"id":4,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/ss_0c18aac765b04f06fd50617033be96edaebb5c99.1920x1080.jpg?t=1736626392","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3269810/ss_0c18aac765b04f06fd50617033be96edaebb5c99.600x338.jpg?t=1736626392"}],"short_description":"KNOCKOFF is an upcoming Iso-fighter RPG, set in a Lovecraftian mall taken over by various gangs. Featuring a blend of RPG decision making and fighting game combat, KNOCKOFF is like nothing you've ever seen.","steam_appid":3269810,"support_info":{"email":"terraformss@gmail.com","url":""},"supported_languages":"English","type":"game","website":null}