{"about_the_game":"<p class=\"bb_paragraph\">The Fox and the Devil is a role-playing and strategy game in which the player takes control of Eleonora, a half-demon who has lost her mother in a war that has lasted for years. Over the course of the game, Eleonora must decide whether to embrace her demonic side and forgive the demons who killed her mother, or fight alongside the humans who demonize her race.</p><p class=\"bb_paragraph\"><strong><i>Gameplay: </i></strong></p><p class=\"bb_paragraph\">The Fox and the Devil is a (Hentai)turn-based RPG in which you must try to choose the best course of action to defeat the enemies, build our own statagy, explore a huge world, return old areas for new content and see how your actions change the world as you progress through the game, solve puzzles and more.</p><p class=\"bb_paragraph\"><strong><i><br>Current content:</i></strong></p><p class=\"bb_paragraph\">The Fox and devil is in Early Access. At current state there is 2 out 12 Planned chapters. <br>There is something arround 3~4 Hours of gameplay, 870 Images in 45 Cgs.</p>","background":"https://store.akamai.steamstatic.com/images/storepagebackground/app/3350380?t=1740445436","background_raw":"https://store.akamai.steamstatic.com/images/storepagebackground/app/3350380?t=1740445436","capsule_image":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/eabcea287220823eeb5da361b4a8ff1d2eae7eb4/capsule_231x87.jpg?t=1740445436","capsule_imagev5":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/eabcea287220823eeb5da361b4a8ff1d2eae7eb4/capsule_184x69.jpg?t=1740445436","categories":[{"description":"Single-player","id":2},{"description":"Full controller support","id":28}],"content_descriptors":{"ids":[1,3,4,5],"notes":"The game contains explicit sex and should only be consumed by adults over the age of 18.\r\n\r\nSensitive themes; Sex with monsters, Moderate violence, Pregnancy, Derogatory language."},"controller_support":"full","detailed_description":"<p class=\"bb_paragraph\">The Fox and the Devil is a role-playing and strategy game in which the player takes control of Eleonora, a half-demon who has lost her mother in a war that has lasted for years. Over the course of the game, Eleonora must decide whether to embrace her demonic side and forgive the demons who killed her mother, or fight alongside the humans who demonize her race.</p><p class=\"bb_paragraph\"><strong><i>Gameplay: </i></strong></p><p class=\"bb_paragraph\">The Fox and the Devil is a (Hentai)turn-based RPG in which you must try to choose the best course of action to defeat the enemies, build our own statagy, explore a huge world, return old areas for new content and see how your actions change the world as you progress through the game, solve puzzles and more.</p><p class=\"bb_paragraph\"><strong><i><br>Current content:</i></strong></p><p class=\"bb_paragraph\">The Fox and devil is in Early Access. At current state there is 2 out 12 Planned chapters. <br>There is something arround 3~4 Hours of gameplay, 870 Images in 45 Cgs.</p>","developers":["Somatra"],"genres":[{"description":"Action","id":"1"},{"description":"Adventure","id":"25"},{"description":"Casual","id":"4"},{"description":"Indie","id":"23"},{"description":"RPG","id":"3"},{"description":"Early Access","id":"70"}],"header_image":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/header.jpg?t=1740445436","is_free":false,"legal_notice":"End-User License Agreement (\"Agreement\")<br />\r\nLast updated: January 15, 2025<br />\r\n<br />\r\nPlease read this End-User License Agreement carefully before clicking the \"I Agree\" button, downloading or using Tales of Eleonora.<br />\r\n<br />\r\nInterpretation and Definitions<br />\r\nInterpretation<br />\r\nThe words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.<br />\r\n<br />\r\nDefinitions<br />\r\nFor the purposes of this End-User License Agreement:<br />\r\n<br />\r\nAgreement means this End-User License Agreement that forms the entire agreement between You and the Company regarding the use of the Application. This Agreement has been created with the help of the EULA Generator.<br />\r\n<br />\r\nApplication means the software program provided by the Company downloaded by You to a Device, named Tales of Eleonora<br />\r\n<br />\r\nCompany (referred to as either \"the Company\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to Tales of Eleonora.<br />\r\n<br />\r\nContent refers to content such as text, images, or other information that can be posted, uploaded, linked to or otherwise made available by You, regardless of the form of that content.<br />\r\n<br />\r\nCountry refers to: Brazil<br />\r\n<br />\r\nDevice means any device that can access the Application such as a computer, a cellphone or a digital tablet.<br />\r\n<br />\r\nThird-Party Services means any services or content (including data, information, applications and other products services) provided by a third-party that may be displayed, included or made available by the Application.<br />\r\n<br />\r\nYou means the individual accessing or using the Application or the company, or other legal entity on behalf of which such individual is accessing or using the Application, as applicable.<br />\r\n<br />\r\nAcknowledgment<br />\r\nBy clicking the \"I Agree\" button, downloading or using the Application, You are agreeing to be bound by the terms and conditions of this Agreement. If You do not agree to the terms of this Agreement, do not click on the \"I Agree\" button, do not download or do not use the Application.<br />\r\n<br />\r\nThis Agreement is a legal document between You and the Company and it governs your use of the Application made available to You by the Company.<br />\r\n<br />\r\nThe Application is licensed, not sold, to You by the Company for use strictly in accordance with the terms of this Agreement.<br />\r\n<br />\r\nLicense<br />\r\nScope of License<br />\r\nThe Company grants You a revocable, non-exclusive, non-transferable, limited license to download, install and use the Application strictly in accordance with the terms of this Agreement.<br />\r\n<br />\r\nThe license that is granted to You by the Company is solely for your personal, non-commercial purposes strictly in accordance with the terms of this Agreement.<br />\r\n<br />\r\nThird-Party Services<br />\r\nThe Application may display, include or make available third-party content (including data, information, applications and other products services) or provide links to third-party websites or services.<br />\r\n<br />\r\nYou acknowledge and agree that the Company shall not be responsible for any Third-party Services, including their accuracy, completeness, timeliness, validity, copyright compliance, legality, decency, quality or any other aspect thereof. The Company does not assume and shall not have any liability or responsibility to You or any other person or entity for any Third-party Services.<br />\r\n<br />\r\nYou must comply with applicable Third parties' Terms of agreement when using the Application. Third-party Services and links thereto are provided solely as a convenience to You and You access and use them entirely at your own risk and subject to such third parties' Terms and conditions.<br />\r\n<br />\r\nTerm and Termination<br />\r\nThis Agreement shall remain in effect until terminated by You or the Company. The Company may, in its sole discretion, at any time and for any or no reason, suspend or terminate this Agreement with or without prior notice.<br />\r\n<br />\r\nThis Agreement will terminate immediately, without prior notice from the Company, in the event that you fail to comply with any provision of this Agreement. You may also terminate this Agreement by deleting the Application and all copies thereof from your Device or from your computer.<br />\r\n<br />\r\nUpon termination of this Agreement, You shall cease all use of the Application and delete all copies of the Application from your Device.<br />\r\n<br />\r\nTermination of this Agreement will not limit any of the Company's rights or remedies at law or in equity in case of breach by You (during the term of this Agreement) of any of your obligations under the present Agreement.<br />\r\n<br />\r\nIndemnification<br />\r\nYou agree to indemnify and hold the Company and its parents, subsidiaries, affiliates, officers, employees, agents, partners and licensors (if any) harmless from any claim or demand, including reasonable attorneys' fees, due to or arising out of your: (a) use of the Application; (b) violation of this Agreement or any law or regulation; or (c) violation of any right of a third party.<br />\r\n<br />\r\nNo Warranties<br />\r\nThe Application is provided to You \"AS IS\" and \"AS AVAILABLE\" and with all faults and defects without warranty of any kind. To the maximum extent permitted under applicable law, the Company, on its own behalf and on behalf of its affiliates and its and their respective licensors and service providers, expressly disclaims all warranties, whether express, implied, statutory or otherwise, with respect to the Application, including all implied warranties of merchantability, fitness for a particular purpose, title and non-infringement, and warranties that may arise out of course of dealing, course of performance, usage or trade practice. Without limitation to the foregoing, the Company provides no warranty or undertaking, and makes no representation of any kind that the Application will meet your requirements, achieve any intended results, be compatible or work with any other software, applications, systems or services, operate without interruption, meet any performance or reliability standards or be error free or that any errors or defects can or will be corrected.<br />\r\n<br />\r\nWithout limiting the foregoing, neither the Company nor any of the company's provider makes any representation or warranty of any kind, express or implied: (i) as to the operation or availability of the Application, or the information, content, and materials or products included thereon; (ii) that the Application will be uninterrupted or error-free; (iii) as to the accuracy, reliability, or currency of any information or content provided through the Application; or (iv) that the Application, its servers, the content, or e-mails sent from or on behalf of the Company are free of viruses, scripts, trojan horses, worms, malware, timebombs or other harmful components.<br />\r\n<br />\r\nSome jurisdictions do not allow the exclusion of certain types of warranties or limitations on applicable statutory rights of a consumer, so some or all of the above exclusions and limitations may not apply to You. But in such a case the exclusions and limitations set forth in this section shall be applied to the greatest extent enforceable under applicable law. To the extent any warranty exists under law that cannot be disclaimed, the Company shall be solely responsible for such warranty.<br />\r\n<br />\r\nLimitation of Liability<br />\r\nNotwithstanding any damages that You might incur, the entire liability of the Company and any of its suppliers under any provision of this Agreement and your exclusive remedy for all of the foregoing shall be limited to the amount actually paid by You for the Application or through the Application or 100 USD if You haven't purchased anything through the Application.<br />\r\n<br />\r\nTo the maximum extent permitted by applicable law, in no event shall the Company or its suppliers be liable for any special, incidental, indirect, or consequential damages whatsoever (including, but not limited to, damages for loss of profits, loss of data or other information, for business interruption, for personal injury, loss of privacy arising out of or in any way related to the use of or inability to use the Application, third-party software and/or third-party hardware used with the Application, or otherwise in connection with any provision of this Agreement), even if the Company or any supplier has been advised of the possibility of such damages and even if the remedy fails of its essential purpose.<br />\r\n<br />\r\nSome states/jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so the above limitation or exclusion may not apply to You.<br />\r\n<br />\r\nSeverability and Waiver<br />\r\nSeverability<br />\r\nIf any provision of this Agreement is held to be unenforceable or invalid, such provision will be changed and interpreted to accomplish the objectives of such provision to the greatest extent possible under applicable law and the remaining provisions will continue in full force and effect.<br />\r\n<br />\r\nWaiver<br />\r\nExcept as provided herein, the failure to exercise a right or to require performance of an obligation under this Agreement shall not affect a party's ability to exercise such right or require such performance at any time thereafter nor shall the waiver of a breach constitute a waiver of any subsequent breach.<br />\r\n<br />\r\nProduct Claims<br />\r\nThe Company does not make any warranties concerning the Application.<br />\r\n<br />\r\nUnited States Legal Compliance<br />\r\nYou represent and warrant that (i) You are not located in a country that is subject to the United States government embargo, or that has been designated by the United States government as a \"terrorist supporting\" country, and (ii) You are not listed on any United States government list of prohibited or restricted parties.<br />\r\n<br />\r\nChanges to this Agreement<br />\r\nThe Company reserves the right, at its sole discretion, to modify or replace this Agreement at any time. If a revision is material we will provide at least 30 days' notice prior to any new terms taking effect. What constitutes a material change will be determined at the sole discretion of the Company.<br />\r\n<br />\r\nBy continuing to access or use the Application after any revisions become effective, You agree to be bound by the revised terms. If You do not agree to the new terms, You are no longer authorized to use the Application.<br />\r\n<br />\r\nGoverning Law<br />\r\nThe laws of the Country, excluding its conflicts of law rules, shall govern this Agreement and your use of the Application. Your use of the Application may also be subject to other local, state, national, or international laws.<br />\r\n<br />\r\nEntire Agreement<br />\r\nThe Agreement constitutes the entire agreement between You and the Company regarding your use of the Application and supersedes all prior and contemporaneous written or oral agreements between You and the Company.<br />\r\n<br />\r\nYou may be subject to additional terms and conditions that apply when You use or purchase other Company's services, which the Company will provide to You at the time of such use or purchase.<br />\r\n<br />\r\nContact Us<br />\r\nIf you have any questions about this Agreement, You can contact Us:<br />\r\n<br />\r\nBy email: somatra.devteam2@gmail.com","linux_requirements":[],"mac_requirements":[],"movies":[{"highlight":true,"id":257096926,"mp4":{"480":"http://video.akamai.steamstatic.com/store_trailers/257096926/movie480.mp4?t=1740445138","max":"http://video.akamai.steamstatic.com/store_trailers/257096926/movie_max.mp4?t=1740445138"},"name":"TOE2","thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/257096926/7cf78dfb1f33c7ab408b6472b85638ec4dd14fa3/movie_600x337.jpg?t=1740445138","webm":{"480":"http://video.akamai.steamstatic.com/store_trailers/257096926/movie480_vp9.webm?t=1740445138","max":"http://video.akamai.steamstatic.com/store_trailers/257096926/movie_max_vp9.webm?t=1740445138"}},{"highlight":true,"id":257094530,"mp4":{"480":"http://video.akamai.steamstatic.com/store_trailers/257094530/movie480.mp4?t=1740445141","max":"http://video.akamai.steamstatic.com/store_trailers/257094530/movie_max.mp4?t=1740445141"},"name":"TOE1","thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/257094530/5e6938a4508bc22371b9d1e3f23d6c460cbe387b/movie_600x337.jpg?t=1740445141","webm":{"480":"http://video.akamai.steamstatic.com/store_trailers/257094530/movie480_vp9.webm?t=1740445141","max":"http://video.akamai.steamstatic.com/store_trailers/257094530/movie_max_vp9.webm?t=1740445141"}}],"name":"The Fox and Devil: Tales Of Eleonora","package_groups":[],"pc_requirements":{"minimum":"<strong>Minimum:</strong><br><ul class=\"bb_ul\"><li><strong>OS *:</strong> Microsoft Windows 7/8/8.1/10 (32bit/64bit)<br></li><li><strong>Processor:</strong> Intel Core2 Duo<br></li><li><strong>Memory:</strong> 4 GB RAM<br></li><li><strong>Graphics:</strong> DirectX 9 / OpenGL 4.1 capable GPU<br></li><li><strong>DirectX:</strong> Version 9.0<br></li><li><strong>Storage:</strong> 1 GB available space<br></li><li><strong>Additional Notes:</strong> 1280x768 Display</li></ul>","recommended":"<strong>Recommended:</strong><br><ul class=\"bb_ul\"><li><strong>OS *:</strong> Windows 11/10/8<br></li><li><strong>Processor:</strong> 2+ GHz Processor<br></li><li><strong>Memory:</strong> 4 GB RAM<br></li><li><strong>Graphics:</strong> OpenGL ES 2.0 hardware driver support required for WebGL acceleration. (AMD Catalyst 10.9, nVidia 358.50)<br></li><li><strong>DirectX:</strong> Version 9.0<br></li><li><strong>Storage:</strong> 1 GB available space<br></li><li><strong>Additional Notes:</strong> 1280x768 Display</li></ul>"},"platforms":{"linux":false,"mac":false,"windows":true},"publishers":["Somatra Games"],"ratings":{"dejus":{"banned":"0","descriptors":"Nudez\nViolência\nTemas sensíveis","rating":"18","rating_generated":"1","required_age":"18","use_age_gate":"0"},"steam_germany":{"banned":"1","descriptors":"Sexualisierte Gewalt / Sexual violence\nGewalt\nDrogen","rating":"BANNED","rating_generated":"1","required_age":"2147483647","use_age_gate":"0"}},"release_date":{"coming_soon":true,"date":"Coming soon"},"required_age":0,"screenshots":[{"id":0,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_654a660f8473ccad46b1d74afd513b0179567d56.1920x1080.jpg?t=1740445436","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_654a660f8473ccad46b1d74afd513b0179567d56.600x338.jpg?t=1740445436"},{"id":1,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_14b9c158ec7b6e19f27f4738da252eacb067f82e.1920x1080.jpg?t=1740445436","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_14b9c158ec7b6e19f27f4738da252eacb067f82e.600x338.jpg?t=1740445436"},{"id":2,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_5f944ecd01a4b2c32b9510e2f99bb4e2c793675c.1920x1080.jpg?t=1740445436","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_5f944ecd01a4b2c32b9510e2f99bb4e2c793675c.600x338.jpg?t=1740445436"},{"id":3,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_f805600fc4f3147f22030d9a47ab8a27701a4584.1920x1080.jpg?t=1740445436","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_f805600fc4f3147f22030d9a47ab8a27701a4584.600x338.jpg?t=1740445436"},{"id":4,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_e4584ac28a58ddc82960d9c6a700622fd870e622.1920x1080.jpg?t=1740445436","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_e4584ac28a58ddc82960d9c6a700622fd870e622.600x338.jpg?t=1740445436"},{"id":5,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_34fd0e7e367532b7543423b466b949f1f8454bae.1920x1080.jpg?t=1740445436","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_34fd0e7e367532b7543423b466b949f1f8454bae.600x338.jpg?t=1740445436"},{"id":6,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_eac32e7b8e1afe92a4d27cd13a419d0ca1e2f495.1920x1080.jpg?t=1740445436","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3350380/ss_eac32e7b8e1afe92a4d27cd13a419d0ca1e2f495.600x338.jpg?t=1740445436"}],"short_description":"The Fox and the Devil is a role-playing and strategy game in a mediaval fantasy world.","steam_appid":3350380,"support_info":{"email":"somatra.devteam2@gmail.com","url":""},"supported_languages":"English","type":"game","website":null}