{"about_the_game":"<strong>Welcome in Düsseldorf!</strong><br><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/Main_Title.png?t=1635579016\" /><br><br>Take a the driver seat of one out of five different tramways and explore Düsseldorf anno 1981! Drive across the great Jan-Wellem-Platz, cross the Rhine over the Oberkassler bridge and really turn up when it goes over the overland route to Krefeld!<h2 class=\"bb_tag\">The Tramways</h2>The addon includes typical Düsseldorf vehicles; all of them have a wide range of functions. Here is a brief overview:<br><br><strong>GT8S</strong><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/GT8S_Description.png?t=1635579016\" /><br>Construction: 1973 - 1975<br>max speed: ~76km/h<br><br>The GT8S is the first light rail vehicle of the Rheinische Bahngesellschaft AG and was intended to drive through the new tunnel. But this never happened, instead 40 vehicles of this type were converted into GT8SU, the remaining vehicles remained in the tram network. The vehicle has driving and braking control via a setpoint device and is a real bi-directional vehicle. Despite the setpoint generator, it remains a challenge to drive this headstrong vehicle.<br><br><strong>GT6*/GT8</strong><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/GT8_Description.png?t=1635579016\" /><br>Construction: 1956 - 1969<br>max speed: ~65km/h<br><br>Rising passenger numbers and increased demands on local public transport forced Rheinische Bahngesellschaft AG to act. Together with the Düsseldorf wagon factory &quot;DüWag&quot;, RBG AG developed a new vehicle type in 1956, which had a walk-in joint by means of a Jakob bogie. The GT6 was born and was quickly produced in large numbers. In 1958, DüWag installed a middle section in the freshly delivered 2310 railcar for its own account, which marked the birth of the GT8. Since then the vehicles have been built in all imaginable variations and sold in many West German cities. The Rheinbahn alone had 167 GT6 and GT8 at peak times.<br>However, that is no reason to turn the wheel: The crank switch is more demanding to drive than the setpoint generator and requires the highest concentration from the player at all times in order to drive the train safely through Düsseldorf and the surrounding area.<br><br><strong>B80D Stahl</strong><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/B80_Description.png?t=1635579016\" /><br>Construction: 1981<br>max speed: ~80km/h<br><br>Called by some as the crème de la crème of rail vehicle construction, the B80D is the vehicle that was ordered and built exclusively for the light rail lines. With comfortable air suspension, three-phase motors and a sophisticated control system, it is the ideal vehicle for overland and tunnel routes for both the driver and the passenger.<br><br><strong>GT8SU</strong><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/GT8SU_Description.png?t=1635579016\" /><br>Baujahr: 1981-1984<br>vMax: ~76km/h<br><br>Developed from the GT8S, the GT8SU is a typical conversion vehicle. Its great advantage is the universal usability both in the tunnel and on the surface, which is achieved by the complex folding step construction. You can clearly see where it was developed from, but there are more differences than you might expect!<h2 class=\"bb_tag\">The Map: Düsseldorf in 1981</h2>In 1981 Düsseldorf had an extensive tram network and many lines that connected not only the city center, but also the outskirts and neighboring cities to the state capital. You will experience three lines with this addon:<br><br>In addition to Düsseldorf city center with the main train station and above all the central junction, the &quot;Jan-Wellem-Platz&quot;, you can also go to Belsenplatz in the direction of Krefeld Rheinstrasse. The scenery changes from an urban big city and highways in the center to Wilhelminian style houses and old buildings in Oberkassel, further to fallow industrial areas in Niederkassel and Lörick, to forests and meadows in Meerbusch until finally the settlement in Krefeld is reached again.<br><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/Luegallee_Description.png?t=1635579016\" /><br><br>For fans of debauched track systems, the route offers the four-track stop Hauptbahnhof with a three-track turning loop and an extra turning track for line 76, Jan-Wellem-Platz with its countless train and bus platforms, the three-track stops Opera House, Belsenplatz and Meerbusch-Haus Meer , the Meerbusch-Hoterheide reversing loop with an equally abstruse track layout and the four-rail track in Krefeld with the old turning system on Rheinstrasse in Krefeld.<br><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/JWP_Description.png?t=1635579016\" /><br><br>All the vehicles that are used on the three lines must of course also find shelter. In addition, we offer the depot at Am Steinberg, which has 17 tracks for the trams. Built in 1907, the hall has been preserved to this day and now offers a roof and pit for today's historic vehicles that were still in daily use in the add-on.<br><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/Steinberg_Discription.png?t=1635579016\" /><br>Current state of Development!<br><br>For a rough overview, we have a network plan for you:<br><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/Netzplan_Description.png?t=1635579016\" /><br><br>If you are unsure whether the product has already advanced far enough for your requirements, please read these topics in the LOTUS forum carefully. If you have any questions, you can also create topics in the guest area of the forum without the need for registration.<br><br><br><br><br><br><br>if you do not speak german, you could use for example google translator: <br><br>Please only buy the product if you are well informed about what to expect. It is early access and NOT done.<br><br>* Please Note: The GT6 will be patched in the course of development","background":"https://store.akamai.steamstatic.com/images/storepagebackground/app/374770?t=1635579016","background_raw":"https://store.akamai.steamstatic.com/images/storepagebackground/app/374770?t=1635579016","capsule_image":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/capsule_231x87.jpg?t=1635579016","capsule_imagev5":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/capsule_184x69.jpg?t=1635579016","categories":[{"description":"Single-player","id":2},{"description":"Multi-player","id":1},{"description":"Co-op","id":9},{"description":"Online Co-op","id":38},{"description":"Downloadable Content","id":21},{"description":"Steam Workshop","id":30},{"description":"Partial Controller Support","id":18},{"description":"Family Sharing","id":62}],"content_descriptors":{"ids":[],"notes":null},"detailed_description":"<h1>In Development</h1><p><strong> Warning </strong><br>You purchase an early beta of the product, which is in development. The range of functions will be expanded in the upcoming months, models and textures may be changed again. This also includes the pricing and the scope of the addon:<h2 class=\"bb_tag\">Phase 1: Early Development Line 76 - € 34.99</h2><br><strong>Contains the vehicles</strong><br><ul class=\"bb_ul\"><li>DüWag N/M 6/8 S/D/C<br></li><li>DüWag GT8S<br></li><li>DüWag GT8SU<br></li><li>DüWag GT8<br></li><li>DüWag B4<br></li><li>DüWag B80 steel</li></ul><br><strong>Contains the Düsseldorf map 1981</strong><br><ul class=\"bb_ul\"><li>Düsseldorf Main Station to Jan-Wellem-Platz<br></li><li>Jan-Wellem-Platz to Rheinbahnhaus / Belsenplatz<br></li><li>Belsenplatz to Lörick</li></ul><br>The route length is 8 km when first published.<br><br><strong>Update 1: route</strong><br><ul class=\"bb_ul\"><li>Loop trip Düsseldorf Hbf Graf-Adolf-Platz is added<br></li><li>Route to Meerbusch, Haus Meer (today named &quot;Forsthaus&quot;) will be added </li></ul><br><strong>Update 2: route and AI vehicles</strong><br><ul class=\"bb_ul\"><li>The route from Lörick to Meerbusch-Hoterheide is completely navigable<br></li><li>The MAN SG192 is supplemented as an AI bus</li></ul><br><strong>Update 3: Route </strong><br><ul class=\"bb_ul\"><li>The route from Meerbusch-Hoterheide to Krefeld-Dießem is completely navigable</li></ul><br><strong>Last chance to buy the product for € 34.99! </strong><h2 class=\"bb_tag\">Phase 2: Early Development Line 715 and 76 - € 39.99 </h2><br>Contains all previous updates and additionally:<br><br><ul class=\"bb_ul\"><li>tracks from Krefeld-Dießem to Krefeld-Rheinstraße (completion line 76)<br></li><li>AI tram: Krefeld M8C<br></li><li>AI tram: Krefeld GT8 </li></ul><br><strong>Update 1: route</strong><br><ul class=\"bb_ul\"><li>Route from Jan-Wellem-Platz to Bilk S-Bahn station<br></li><li>Branch line to the depot &quot;Am Steinberg&quot; including passable hall and track systems</li></ul><br><strong>Update 2: Track and player vehicle (completion of line 715) </strong><br><ul class=\"bb_ul\"><li> Route from Bilk S-Bahn station / Karolingerplatz to Holthausen<br></li><li>Loop university clinics<br></li><li>Player vehicle: DüWag GT6 (shorter version of the GT8)</li></ul><br><strong>Last chance to buy the product for € 39.99!</strong><h2 class=\"bb_tag\">Phase 3: Complete completion of the lines and vehicles - € 49.99 </h2><br>In the last phase, the addon contains the following:<br><br><strong>Players vehicles:</strong><ul class=\"bb_ul\"><li>DüWag N/M 6/8 S/D/C<br></li><li>DüWag GT8S<br></li><li>DüWag GT8SU<br></li><li>DüWag GT8<br></li><li>DüWag GT6<br></li><li>DüWag B4<br></li><li>DüWag B80 steel</li></ul><br><strong>Card Düsseldorf 1981:</strong><ul class=\"bb_ul\"><li>Line 76: from Düsseldorf Hbf to Krefeld-Rheinstraße<br></li><li>Line 710: from Meerbusch-Hoterheide to Vennhauser Allee<br></li><li>Line 715: from Oberkassel to Holthausen<br></li><li>Am Steinberg depot<br></li><li>Parallel route through the old town<br></li><li>A total of 40km distance</li></ul><br><strong>AI cars:</strong><ul class=\"bb_ul\"><li>Krefeld GT8<br></li><li>Krefeld M8C<br></li><li>MAN SG192<br></li><li>MAN Metrobus<br></li><li>Contemporary private cars</li></ul></p><br><h1>Update notes</h1><p><h2 class=\"bb_tag\">Patchnotes</h2><br><u>Christmas 2020</u><br>DüWag N/M 6/8 S/C/D now included for free<br><ul class=\"bb_ul\"><li>(B80D) - BUGFIX: Door 1 ran too fast in automatic mode on the second open<br></li><li>(B80D) - BUGFIX: Door 1 will no longer cause the lose of the safety loop while driving<br></li><li>(B80D) - BUGFIX: Mapping for the left mirror fixed<br></li><li>(B80D) - BUGFIX: Mirror left won't be used anymore while opening the doors on the right side<br></li><li>(B80D) - BUGFIX: Roller blind for drivers now seen from F4 view<br></li><li>(B80D) - BUGFIX: Passenger light couldn't be turned off from a coupled train fixed<br></li><li>(B80D) - BUGFIX: Door opener light fixed<br><br></li><li>(B80D) - Revamp of the safety loop<br></li><li>(B80D) - Repaint template now has UV mapping for the hinge<br></li><li>(B80D) - When not pressing the deadmans switch the accleration won't be decreased till the brakes are activated<br></li><li>(B80D) - Texture swap for white interieur<br></li><li>(B80D) - Old fault reporting system now included<br></li><li>(B80D) - Left mirror will be activated, even without using door release, when the doors on the left side are opened<br></li><li>(B80D) - Rubber door linigs model spearated, mouse event added, material changed<br></li><li>(B80D) - Revamp of the material of light indicators<br></li><li>(B80D) - More details added to the outside mesh<br></li><li>(B80D) - Speed control switch will stick to the default position when using keyboard events<br></li><li>(B80D) - Revamp light of the drivers seat<br></li><li>(B80D) - Mirrors are now included in the RC-Script<br></li><li>(B80D) - Controller for time added at the ticket machine<br></li><li>(B80D) - Door and window of the driver's cabin are now moveable<br></li><li>(B80D) - Position of the light barriers improved<br></li><li>(B80D) - Texture of the passenger light improved<br></li><li>(B80D) - Revamp of the material settings for glasses<br></li><li>(B80D) - You can now click on the switch iron to change the direction of the switch ahead<br></li><li>(B80D) - Passenger light will be activated when coupling, if the coupled train has the passenger light already on<br></li><li>(B80D) - Battery script improved: You can switch off the battery and its modules<br></li><li>(B80D) - PIS-Broadcasts are transfered via coupling<br></li><li>(B80D) - Dashboardtextures revamped<br></li><li>(B80D) - Modules revamped<br></li><li>(B80D) - The sound of the ticket validator now fades<br></li><li>(B80D) - Flags are now waving more<br></li><li>(B80D) - Passengers can now enter the train<br></li><li>(B80D) - Brightness of reflektions on glasses reduced<br></li><li>(B80D) - Texture of speedometer revamped<br></li><li>(B80D) - IBIS modules broadcasts are now useable in two-direction operation<br><br></li><li>(GT8) - The pantograph are now module objects <br></li><li>(GT8) - The front lights are now module objects, currently modells for Dusseldorf und Cologne are available<br></li><li>(GT8) - The wire for the pantograph is now in use. Right mouse click on the knot to open the knot and left mouse click to release the wire<br></li><li>(GT8) - The pantograph wire has its own F1 view<br></li><li>(GT8) - Passengers can now enter the train<br><br></li><li>(B4) - Passengers can now enter the train<br><br></li><li>(GT8S) - Passengers can now enter the train (not in GT8S-SP!!)<br></li><li>(GT8S) - Pantographs are now module objects<br><br></li><li>(GT8SU) - render priority of stickers fixed<br></li><li>(GT8SU) - Passengers can now enter the train<br><br></li><li>(MODULE) - BUGFIX: IBIS module doesn't crash when switching off the battery<br></li><li>(MODULE) - IBIS module now can be used for two-directional operation<br></li><li>(MODULE) - IBIS module can receive route information even if switched off<br></li><li>(MODULE) - IBIS module can change tram stops on its own<br><br></li><li>(CONTENT) - route information for line 710 via Berliner Allee (44/45)<br></li><li>(CONTENT) - tram stop annoucements for  Berliner Allee and Stresemannplatz added.<br><br></li><li>(MAP) - New route for line 710 from Dusseldorf main station to Martin-Luther-Platz via Stresemannplatz and Berliner Allee<br></li><li>(MAP) - More details as well as humans and passengers added</li></ul><br><u>17.07.2020</u><br><ul class=\"bb_ul\"><li>(B80D) - Safety loop is now correctly transferred<br></li><li>(B80D) - Door and safety loop can be bypassed<br></li><li>(B80D) - Drag switch scripted (communication not yet switched off)<br></li><li>(B80D) - Added some real time hints<br></li><li>(B80D) - Bug: RLB position for Kaiserswerth corrected<br></li><li>(B80D) - Bug: Windows on the B-head were textured incorrectly, now fixed<br></li><li>(GT8SU) - Windshield wiper B fixed.<br></li><li>(B4) - Vehicle category corrected.<br></li><li>(MAP) - Lörick: Some terrain errors at Böhlerstraße fixed, details at exit of the track loop added<br></li><li>(MAP) - Löricker Straße: Ugly places at the transition from grooved rail to gravel track fixed, some sidewalks at entrances in direction to Lörick repaired<br></li><li>(MAP) - Lohweg: Asphalt colour Grevenbroicher Weg adapted<br></li><li>(MAP) - Belsenplatz: Height of the houses adjusted, AI-paths adjusted in height, details added, overhead line suspension added<br></li><li>(MAP) - Barbarossaplatz to Luegplatz: Corner houses exchanged and added, closing of visual gaps with splines<br></li><li>(MAP) - Rhine bank on the Oberkassel side is now more detailed, second AI path on the bank with access to the bridge added<br></li><li>(MAP) - Luegplatz: road and traffic signs added, hole in terrain fixed, terrain at pedestrian crossings at the tram station fixed, details added<br></li><li>(MAP) - Oberkasseler Brücke: Traffic light for traffic control in direction to Oberkassel added<br></li><li>(MAP) - Rhine bank on the old town side added, second KI path under the Oberkassel bridge added, terrain adjustment Hofgartenrampe, addition of green spaces Hofgartenrampe, addition of park paths into Hofgarten, traffic and street signs Hofgartenrampe added<br></li><li>(MAP) - Adaptation of traffic density Maximilian-Weyhe-Allee<br></li><li>(MAP) - Jan-Wellem-Platz: Details added, Grass polygons to the north added<br></li><li>(MAP) - visual axis from Jan-Wellem-Platz towards Immermannstraße filled in, parking spaces below the centipede added, further detailation Ernst-Schneider Platz<br></li><li>(MAP) - Bismarckstraße: traffic light control pedestrian traffic light adapted<br></li><li>(MAP) - More buildings on Friedrich-Ebert-Straße, Karlstraße, Kurfürstenstraße, Klosterstraße to close sight lines<br></li><li>(MAP) - Adjustment of the Karlstraße road layout<br></li><li>(MAP) - Addition of details about the Karlstraße loop<br></li><li>(MAP) - Revision of the scenery at the turning track near main station, extension of the scenery from the turning track towards Worringer Platz<br></li><li>(MAP) - Normal map for sand texture added<br></li><li>(MAP) - F4 phases for tram adapted to Rilsa<br></li><li>(CONTENT) - More houses for the Luegallee added<br></li><li>(CONTENT) - More bollards and railings added</li></ul><br><u>09.05.2020</u><br><br><ul class=\"bb_ul\"><li>(MAP) - Hauptbahnhof: Prohibition sign for B80/B100 for Karlstraße loop set up, taxi pillars placed, terrain error taxi stand fixed, switch in turning track points in the right direction by default<br></li><li>(MAP) - Bismarckstraße: Terrain fault near the track fixed<br></li><li>(MAP) - Martin-Luther-Platz: Terrain error in curbstone near the track and in another curbstone fixed, parking cars adjusted in height<br></li><li>(MAP) - Centipede: Textures updated, start of design in direction Immermannstraße, parked cars placed below the centipede, detailed work on the terrain, autochaos Ernst-Schneider-Platz solved with the help of a traffic light<br></li><li>(MAP) - Jan-Wellem-Platz: Switch boxes placed, switch position signals partly fixed, more details placed, many terrain errors at the platforms fixed, terrain towards Sternstraße extended and provided with backdrops<br></li><li>(MAP) - Opernhaus: pedestrian underpass texture beautified, manhole covers and shafts no longer flicker, traffic lights, lanterns and overhead line laid towards Wilhelm-Marx-Haus, indicated design of river bank towards Ratinger Tor<br></li><li>(MAP) - tunnel ramp Opernhaus: texture updated, end pieces for the fence created, several holes in the terrain fixed, Ki paths laid towards Grabbeplatz<br></li><li>(MAP) - Ratiner Tor: manhole covers and shafts no longer flicker, start of landscaping park on the side of Ratinger Tor, AI paths laid in Maximilian-Weyhe-Allee<br></li><li>(MAP) - Luegplatz: Polygons on the platform adapted<br></li><li>(MAP) - Belsenplatz: tram traffic lights from Neuss in the direction of the city centre added, signs for alternative stops placed<br></li><li>(MAP) - loop Rheinbahnhaus: terrain error at entrance and exit fixed, hole in track at entrance fixed, key boxes exchanged<br></li><li>(MAP) - All terrain textures improved (not yet 100% complete). Parallax-mapping of &quot;tram&quot; pavement with different heights, parallax-mapping with different heights for chessboard pavement and other pavements, parallax-mapping for curbs, normal map for pavement<br></li><li>(MAP) - Request switch replaced, fault panels at Rheinbahnhaus added, key switch panels added<br></li><li>(MAP) - Revision of the terrain materials (still not final), further paving slabs adapted to the right size, further parallax mapping for edge and curb added<br></li><li>(MAP) - additional traffic lights at the exit of loop Karlstraße<br></li><li>(MAP) - Terrain holes reduced on: Central Station, Rheinbahnhaus, Amboßstraße, Heerdter Sandberg, Lörick<br></li><li>(MAP) - Adaptation of AI paths to avoid congestion (not completed)<br></li><li>(B80D) - BUGFIX: Vehicle is no longer disassembled at spawn point (e.g. Belsenplatz) (via LOTUS patch)<br></li><li>(B80D) - BUGFIX: Central opening on MI or SO possible via keyboard event fixed<br></li><li>(B80D) - BUGFIX: Create stop announcements &quot;Loop&quot; when multiple vehicles are upgraded fixed<br></li><li>(B80D) - BUGFIX: driving lock when more than one head in the train is upgraded does not work properly fixed<br></li><li>(B80D) - BUGFIX: rail brake B hangs too high fixed<br></li><li>(B80D) - BUGFIX: Rollband is not transferred in RC when controlled by IBIS fixed<br></li><li>(B80D) - BUGFIX: Pantograph of another car cannot be lifted when the pantograph of the active car is lifted fixed<br></li><li>(B80D) - BUGFIX: Rear light (left) switched on when reversing although peak illumination is active fixed<br></li><li>(B80D) - Realistic power supply added<br></li><li>(B80D) - Catenary control is also transmitted via coupling<br></li><li>(B80D) - Model modification: front apron shortened<br></li><li>(B80D) - Control via controller Axis &quot;ThrottleBrake&quot; revised<br></li><li>(GT8/S/SP/U) - BUGFIX: Double button assignment works now. Thanks to Marcel Kuhnt for the decisive hint! Please test the controller support!<br></li><li>(GT8S/SP/U) - BUGFIX: Incorrect sound assignment led to stuttering on the GT8SU and to the missing sound from the contactor of the spring memory B on the GT8S<br></li><li>(GT8SU) - BUGFIX: Folding step door 11 fixed. An animation variable was incorrectly assigned<br></li><li>(GT8SU) - BUGFIX: Door 44 was without warning buzzer sound<br></li><li>(GT8SU) - BUGFIX: sound error step selection button HO/SO on B-side fixed<br></li><li>(GT8S) - BUGFIX: top hung window 4L was without correct sound assignment<br></li><li>(GT8S/SP/U) - The vehicle reports via IBIS if no special FIS file was found. Works with fully upgraded place only, if the switch lever is switched once to 0 and again to *, so that a new query routine of the IBIS device starts.<br></li><li>(GT8S/SP/U) - The vehicle reports the settings of the front conveyor belt via IBIS on request. To do this, hold down the Clear key for 10 seconds and enter &quot;01&quot; as the test function. Then click through with Quit. There is no support for everything else that is cheated in the test functions!<br></li><li>(GT8/S/SP/U) - IBIS keys can now also be controlled via the keyboard<br></li><li>(GT8/S/SP/U) - The switch can now be set in front of or behind the train using a turnout iron<br></li><li>(GT8S/SP/U) - Hint for switch iron added<br></li><li>(GT8) - BUGFIX: The hinged window from the 2nd window on the left was not assigned to the correct animation.<br></li><li>(GT8) - BUGFIX: The button &quot;Emergency Braking&quot; now only switches the crank to the last braking level if the change-over lever is not set to &quot;0&quot;.<br></li><li>(GT8) - BUGFIX: Rail brake repaired on first motor bogie.<br></li><li>(GT8) - BUGFIX: When switching off the bulb passenger compartment lighting the fluorescent lamps are no longer visible<br></li><li>(GT8) - &quot;Ö&quot; key now sends a stop request to all doors<br></li><li>(GT8) - Sidecar can now be uncoupled by clicking on the clutch release lever.<br></li><li>(MODULE) - BUGFIX: Missing module class of the front wheel arch added<br></li><li>(MODULE) - BUGFIX: Roller conveyor modules are now also interested in the discontinued home depot<br></li><li>(CONTENT) - BUGFIX: There are no more spezFis for Sonnenburg without textures. Your files are used now :)<br></li><li>(CONTENT) - BUGFIX: Fault panel is now CAT.1 and should be visible even with lower settings<br></li><li>(CONTENT) - BUGFIX: English description GT8 fixed<br></li><li>(CONTENT) - BUGFIX: Mercedes textures repaired, were partially opaque<br></li><li>(CONTENT) - Hint GT8 door release supplemented with further information<br></li><li>(CONTENT) - Guidance GT8S/U Note on cab changes added<br></li><li>(CONTENT) - Instructions GT8S/U List of conveyor belt positions added<br></li><li>(CONTENT) - GT8 manual Note on operation of the conveyor belt added<br></li><li>(CONTENT) - Stop announcements adapted<br></li><li>(CONTENT) - various new objects (signs, request switches, ...)<br></li><li>(CONTENT) - Tails has agreed to deliver his repaint templates for the GT8. Many thanks for that!<br></li><li>(CONTENT) - The trafficlights have moved to the BaseContent and are available for everyone<br></li><li>(CONTENT) - Bollard red/white and black/yellow added</li></ul></p><br><h1>About the Game</h1><strong>Welcome in Düsseldorf!</strong><br><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/Main_Title.png?t=1635579016\" /><br><br>Take a the driver seat of one out of five different tramways and explore Düsseldorf anno 1981! Drive across the great Jan-Wellem-Platz, cross the Rhine over the Oberkassler bridge and really turn up when it goes over the overland route to Krefeld!<h2 class=\"bb_tag\">The Tramways</h2>The addon includes typical Düsseldorf vehicles; all of them have a wide range of functions. Here is a brief overview:<br><br><strong>GT8S</strong><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/GT8S_Description.png?t=1635579016\" /><br>Construction: 1973 - 1975<br>max speed: ~76km/h<br><br>The GT8S is the first light rail vehicle of the Rheinische Bahngesellschaft AG and was intended to drive through the new tunnel. But this never happened, instead 40 vehicles of this type were converted into GT8SU, the remaining vehicles remained in the tram network. The vehicle has driving and braking control via a setpoint device and is a real bi-directional vehicle. Despite the setpoint generator, it remains a challenge to drive this headstrong vehicle.<br><br><strong>GT6*/GT8</strong><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/GT8_Description.png?t=1635579016\" /><br>Construction: 1956 - 1969<br>max speed: ~65km/h<br><br>Rising passenger numbers and increased demands on local public transport forced Rheinische Bahngesellschaft AG to act. Together with the Düsseldorf wagon factory &quot;DüWag&quot;, RBG AG developed a new vehicle type in 1956, which had a walk-in joint by means of a Jakob bogie. The GT6 was born and was quickly produced in large numbers. In 1958, DüWag installed a middle section in the freshly delivered 2310 railcar for its own account, which marked the birth of the GT8. Since then the vehicles have been built in all imaginable variations and sold in many West German cities. The Rheinbahn alone had 167 GT6 and GT8 at peak times.<br>However, that is no reason to turn the wheel: The crank switch is more demanding to drive than the setpoint generator and requires the highest concentration from the player at all times in order to drive the train safely through Düsseldorf and the surrounding area.<br><br><strong>B80D Stahl</strong><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/B80_Description.png?t=1635579016\" /><br>Construction: 1981<br>max speed: ~80km/h<br><br>Called by some as the crème de la crème of rail vehicle construction, the B80D is the vehicle that was ordered and built exclusively for the light rail lines. With comfortable air suspension, three-phase motors and a sophisticated control system, it is the ideal vehicle for overland and tunnel routes for both the driver and the passenger.<br><br><strong>GT8SU</strong><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/GT8SU_Description.png?t=1635579016\" /><br>Baujahr: 1981-1984<br>vMax: ~76km/h<br><br>Developed from the GT8S, the GT8SU is a typical conversion vehicle. Its great advantage is the universal usability both in the tunnel and on the surface, which is achieved by the complex folding step construction. You can clearly see where it was developed from, but there are more differences than you might expect!<h2 class=\"bb_tag\">The Map: Düsseldorf in 1981</h2>In 1981 Düsseldorf had an extensive tram network and many lines that connected not only the city center, but also the outskirts and neighboring cities to the state capital. You will experience three lines with this addon:<br><br>In addition to Düsseldorf city center with the main train station and above all the central junction, the &quot;Jan-Wellem-Platz&quot;, you can also go to Belsenplatz in the direction of Krefeld Rheinstrasse. The scenery changes from an urban big city and highways in the center to Wilhelminian style houses and old buildings in Oberkassel, further to fallow industrial areas in Niederkassel and Lörick, to forests and meadows in Meerbusch until finally the settlement in Krefeld is reached again.<br><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/Luegallee_Description.png?t=1635579016\" /><br><br>For fans of debauched track systems, the route offers the four-track stop Hauptbahnhof with a three-track turning loop and an extra turning track for line 76, Jan-Wellem-Platz with its countless train and bus platforms, the three-track stops Opera House, Belsenplatz and Meerbusch-Haus Meer , the Meerbusch-Hoterheide reversing loop with an equally abstruse track layout and the four-rail track in Krefeld with the old turning system on Rheinstrasse in Krefeld.<br><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/JWP_Description.png?t=1635579016\" /><br><br>All the vehicles that are used on the three lines must of course also find shelter. In addition, we offer the depot at Am Steinberg, which has 17 tracks for the trams. Built in 1907, the hall has been preserved to this day and now offers a roof and pit for today's historic vehicles that were still in daily use in the add-on.<br><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/Steinberg_Discription.png?t=1635579016\" /><br>Current state of Development!<br><br>For a rough overview, we have a network plan for you:<br><br><img class=\"bb_img\" src=\"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/extras/Netzplan_Description.png?t=1635579016\" /><br><br>If you are unsure whether the product has already advanced far enough for your requirements, please read these topics in the LOTUS forum carefully. If you have any questions, you can also create topics in the guest area of the forum without the need for registration.<br><br><br><br><br><br><br>if you do not speak german, you could use for example google translator: <br><br>Please only buy the product if you are well informed about what to expect. It is early access and NOT done.<br><br>* Please Note: The GT6 will be patched in the course of development","developers":["Tram Düsseldorf"],"fullgame":{"appid":"370350","name":"LOTUS-Simulator"},"genres":[{"description":"Casual","id":"4"},{"description":"Indie","id":"23"},{"description":"Simulation","id":"28"}],"header_image":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/header.jpg?t=1635579016","is_free":false,"legal_notice":"The manual, documentation, video images, software, and all the related materials are copyrighted and must not be copied, photocopied or reduced to any electronic medium or machine legible form, neither completely nor in part, without the previous written consent of Florian Gnepper. <br />\r\n<br />\r\nTHE SOFTWARE IS FURNISHED \"AS IS\" AND IT DOES NOT COME FURNISHED WITH ANY GUARANTEE IMPLICIT OR EXPRESS.<br />\r\nTHE AUTHOR DECLINES EVERY RESPONSIBILITY FOR CONTINGENT MALFUNCTIONS, DECELERATION, AND ANY DRAWBACK THAT SHOULD ARISE, USING THIS SOFTWARE. <br />\r\n<br />\r\nCopyright (c) 2020 Tram Düsseldorf. All rights reserved.<br />\r\n<br />\r\nImprint:<br />\r\nFlorian Gnepper, represented by<br />\r\nOriolus Software GmbH<br />\r\nZum Klostersee 15<br />\r\nD-27442 Gnarrenburg","linux_requirements":[],"mac_requirements":[],"movies":[{"highlight":true,"id":256780335,"mp4":{"480":"http://video.akamai.steamstatic.com/store_trailers/256780335/movie480.mp4?t=1588149351","max":"http://video.akamai.steamstatic.com/store_trailers/256780335/movie_max.mp4?t=1588149351"},"name":"Work-in-Progress Trailer","thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/256780335/movie.293x165.jpg?t=1588149351","webm":{"480":"http://video.akamai.steamstatic.com/store_trailers/256780335/movie480.webm?t=1588149351","max":"http://video.akamai.steamstatic.com/store_trailers/256780335/movie_max.webm?t=1588149351"}}],"name":"LOTUS-Simulator: Düsseldorf 1981","package_groups":[{"description":"","display_type":0,"is_recurring_subscription":"false","name":"default","save_text":"","selection_text":"Select a purchase option","subs":[{"can_get_free_license":"0","is_free_license":false,"option_description":"","option_text":"LOTUS-Addon: Düsseldorf 1981 - $38.99 USD","packageid":69177,"percent_savings":0,"percent_savings_text":" ","price_in_cents_with_discount":3899}],"title":"Buy LOTUS-Simulator: Düsseldorf 1981"}],"packages":[69177],"pc_requirements":{"minimum":"<strong>Minimum:</strong><br><ul class=\"bb_ul\"><li><strong>OS *:</strong> Windows 7, 8 ,10<br></li><li><strong>Processor:</strong> 3,1 GHz, 4 Cores<br></li><li><strong>Memory:</strong> 4 GB RAM<br></li><li><strong>Graphics:</strong> 1024MB VRAM<br></li><li><strong>Storage:</strong> 15 GB available space<br></li><li><strong>Additional Notes:</strong> OpenGL 3.3, Internet-Connection needed for online-verification</li></ul>"},"platforms":{"linux":false,"mac":false,"windows":true},"price_overview":{"currency":"USD","discount_percent":0,"final":3899,"final_formatted":"$38.99 USD","initial":3899,"initial_formatted":""},"publishers":["Tram Düsseldorf"],"ratings":{"dejus":{"rating":"l"}},"release_date":{"coming_soon":false,"date":"29 Apr, 2020"},"required_age":0,"screenshots":[{"id":0,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_c645f82230550115212c97bfce250ddc4ef349b9.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_c645f82230550115212c97bfce250ddc4ef349b9.600x338.jpg?t=1635579016"},{"id":1,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_9f31875b0678328a91a39c3c1192c6c8317e1ff2.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_9f31875b0678328a91a39c3c1192c6c8317e1ff2.600x338.jpg?t=1635579016"},{"id":2,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_3324fe2a9bdc58cc582a5e8191688123f1404d60.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_3324fe2a9bdc58cc582a5e8191688123f1404d60.600x338.jpg?t=1635579016"},{"id":3,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_13ad8864bfbde392cca720835315607bd695224a.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_13ad8864bfbde392cca720835315607bd695224a.600x338.jpg?t=1635579016"},{"id":4,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_974bfab62afe71c37736edaadb24ae24e3011044.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_974bfab62afe71c37736edaadb24ae24e3011044.600x338.jpg?t=1635579016"},{"id":5,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_a69a318bc098c90fb73cb0be0f6dbb1a15b8e780.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_a69a318bc098c90fb73cb0be0f6dbb1a15b8e780.600x338.jpg?t=1635579016"},{"id":6,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_5505710d58dffde2dc07fb50b81f4aa19ab9fa2b.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_5505710d58dffde2dc07fb50b81f4aa19ab9fa2b.600x338.jpg?t=1635579016"},{"id":7,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_670fce5f4628c5a9b527659b03a2fc2b5e80550d.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_670fce5f4628c5a9b527659b03a2fc2b5e80550d.600x338.jpg?t=1635579016"},{"id":8,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_8813ab5626e8f53f2105995e3d2ab0b8ddc0d8e6.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_8813ab5626e8f53f2105995e3d2ab0b8ddc0d8e6.600x338.jpg?t=1635579016"},{"id":9,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_e26579098a786a7749f7ba163db7b2a6cf33fcea.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_e26579098a786a7749f7ba163db7b2a6cf33fcea.600x338.jpg?t=1635579016"},{"id":10,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_348e92bc152aafed46fc44f9e2ef62fe45f86533.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_348e92bc152aafed46fc44f9e2ef62fe45f86533.600x338.jpg?t=1635579016"},{"id":11,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_4c2ab16c400bb741df77108e91779dd6b1c566fe.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_4c2ab16c400bb741df77108e91779dd6b1c566fe.600x338.jpg?t=1635579016"},{"id":12,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_16bd1d6642ecb489f8a7138a88573c82926b852a.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_16bd1d6642ecb489f8a7138a88573c82926b852a.600x338.jpg?t=1635579016"},{"id":13,"path_full":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_468478087f3f71958aaf16a732d1421358fc0fe6.1920x1080.jpg?t=1635579016","path_thumbnail":"https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/374770/ss_468478087f3f71958aaf16a732d1421358fc0fe6.600x338.jpg?t=1635579016"}],"short_description":"Welcome to Dusseldorf! Get yourself seated in a tramway and travel through Dusseldorf and neighboring cities in the year 1981. Includes the Map &quot;Düsseldorf 1981&quot; and various Vehicles!","steam_appid":374770,"support_info":{"email":"","url":"https://www.lotus-simulator.de/forum/index.php?board/43-feedback-diskussionen-support/"},"supported_languages":"English, German<strong>*</strong><br><strong>*</strong>languages with full audio support","type":"dlc","website":"https://www.lotus-simulator.de/"}